{"pages":[],"posts":[{"title":"为什么开启这个里世界？","text":"很久没有静下心来写东西了，总是沉迷于搞些小玩意儿，比如小插件、小工具，主站的主题越来越复杂强大，这也算是我一天天看着成长起来的，然而我却掉队了，依然徘徊在2.0版本，没什么理由，只是觉得自己喜欢修修补补，今天搞个特效，明天加个功能，很有趣我也很入迷。但最近越来越觉得，我正在远离创作者的阵营，离“开发者”又相距甚远，所以为了纠正下状态，我唯一能做且想做的，就是找回书写的乐趣，更进一步讲，是找回不断总结的习惯。为此，我翻了一堆主题，力图寻找到一个专注写作专注文字的主题，很幸运，icarus的主题作者的另一主题minos，完美的迎合了我的口味，简洁但绝非简单，扩展比较全面。因此就有这个页面啦。今后的日子里，我会在这里放英语文章、中文随想或者是非技术类的文字向文章，欢迎多多支持！ 需要做的事 配置项补全，但我不想配置单独的分类页标签页了，这样就非常棒了，依附于主站，没有多余的内容嵌套。 评论，这是得需要的，打算仍然用valine，配合页面计数，直接一步到位了。 页面访问统计，这个应该跟随主站，所以统计代码直接迁移即可。 添加返回主站的操作入口，比如按钮，还没想好。 SEO，这部分不重要吧，已经是很主观的东西了。 换一下头图。 结语貌似又是一大波折腾，但都比较简单，重点是如果可以获得一个比较舒适的写作空间，那这也是值得的。","link":"/words/cd67.html"},{"title":"我眼中的《姜子牙》——三界官场现形记","text":"十年前，时值汉东省人事更替 副省长人选尊某因破获“11.11”特大走私案件，一举打掉了本省最大的走私集团实力，并且揪出了该势力和其竞争对手-时任组织部部长魏九的密切联系，致使魏九被离职审查，后经领导班子决议，尊某成功上任汉东省副省长，由此，汉东省步入了杜绝走私的经济发展快车道。 魏九落马，被限制在其老家清水市进一步审查，一年之后，汉东省全省筹备召开“杜绝走私研讨会暨暂1111大案表彰大会”，尊副省长亲自致电时任清水市公安局长姜涯，要求其尽快将魏九依法定罪逮捕。 姜局长终于见到了最终BOSS。一年前的“猎狐行动”他还记忆犹新，部分顽固份子拼死抵抗，致使行动过程出现一死两伤，后经查证清水市作为龙头重镇经济受到了走私势力的严重侵蚀，此刻于公于私，姜涯都想赶紧给魏九定罪，一切都在稳步推进，但就在向检察院递交材料的前夜，魏九在家中和姜涯见了一面，这“违规”的见面，竟透露给了姜局长一个秘密… 当年的走私大案，另有隐情。密会中，魏九给了一个人的资料给姜局长，她叫九妹，在1111大案中以被抓获羁押候审，卷宗显示其涉嫌多起走私和挪用公款案件，和魏九有密切联系，过了今晚的材料递交，应该会定重罪入狱，但魏九却说，她是清白的。 九妹是无辜的？案子不能结！ 姜局长力排众议，终究没能在当晚递交材料，而同一晚，魏九动用了所有关系，给九妹制造了无罪证据。当晚姜局和尊副省长告知了他的想法，或者说信念：一个人的清白都不顾，何以顾一方平安？尊副省长听罢大怒，他让姜涯冷静几天好好反思自己的立场，并让其他人暂时接替他的工作。 几天后，魏九还是锒铛入狱，姜局长被停职反省，其得力干将们也遭受到了非议和排挤，出乎意料的是，九妹因证据不足被免于起诉，不日就被释放，自此猎狐行动正式结束，姜局原本作为清水市公安局长应该被嘉奖提拔，但现在却落得个无官一身轻。 那时候，姜局每天都泡在离家不远的酒馆里，不料那一天，竟然碰到了那个女人：九妹。 作为城郊的酒馆，本该非常普通，但一年前公安部执行猎狐行动时，前线指挥部就在这里，准确的说是把这当场了临时食堂，自然有些信息会在这里被流出，老板耳濡目染，对整个“1111答案”的大小事也可以算是门儿清。九妹来这的目的，就是为了调查她父亲的事情。她一直以为他父亲兢兢业业，不理解为何会触犯法律，于是她想以一己之力查明真相。 姜涯见状，顺水推舟，承诺和他一起调查，查明真相或许也是对当年自己的一个交代。 在后来的接触中，姜涯逐渐了解了九妹的身世… 九妹的父亲是轴网科技集团的高管，轴网科技是当时清水市名噪一时的大企业，九妹大学毕业后就被安排进了公司给总裁做秘书，其父用意不言自明，后来她和总裁轴某，也确实发展为了男女朋友，不过与此同时，当时已经身为南高县县长的魏九，也把魔抓伸向了她。 当时年少青春的九妹，只把魏九当做忘年交，亦师亦友，在后来轴网科技的发展中，作为轴某的女友，在魏九的蛊惑下给轴网的发展提了很多非法“建议”，在魏九的暗中运作下，轴网集团一发不可收拾，凭借着非法获利，其在当时迅速建立了一个庞大的、以高新科技为外衣的走私帝国，霸占了当时的各大财经版面。九妹就这样，被魏九当做“影子”操控了轴网集团，而作为“领导有方”的魏九也从此发迹，人脉势力迅速扩张。以至于十年前，已经担任省委组织部长，成了接任副省长的热门人选。 &lt;&lt; 更多精彩尽在『程序萌部落』 &gt;&gt;&lt;&lt; https://www.cxmoe.com &gt;&gt; 帝国的崩塌非一朝一夕。 轴网集团的辉煌，只持续了两年，之后，由于轴某的资金管理不善、人事经营散乱，整个集团资金链出现严重问题，魏九早已升任组织部长，时任县长只得为其“输血”试图挽救，但随着各种集团黑幕的爆出，对轴网集团讨伐的社会舆论已经充斥了整个南高县、清水市，在不断涌现出来的大量的事实证据面前，汉东省委终于带头开展了猎狐行动。 行动波及面之广，几乎涉及了清水市的各行各业，那段时间一众上市公司停牌整顿，不少民营企业也因资金管理问题被迫吞下天价罚单，行动虽是为了打击走私违法势力，但其对整个清水市造成的负面效果，姜涯是深有体会的。而九妹，就在这大起大落中，饱受了生活的摧残，而她自始至终都不知道，她一直如棋子般任人摆布，终究不得安宁的生活。 了解到这里，姜涯终于大概明白了为何魏九说九妹是无辜的，了解到了猎狐行动对清水市尤其是南高县的负面影响。他依旧不解的问题是：从南高县一路升上去的魏九，在猎狐行动如此高调的前提下自然难逃干系，或者说，猎狐行动，就是针对魏九的一次行动？ 在整理了九妹的全部资料后，姜涯悉数递交给了纪委监委，姜不知道的是，这一举动，直接导致1111案件的主要犯罪嫌疑人魏九因为犯罪证据不实而被重审，这可谓是“放虎归山”！尊副省长获悉此事，立刻给当时负责工作的清水市领导施压，并动用自己的关系，暗地里将魏九给九妹伪造的证据“不合法”的毁掉，因此，在姜涯上报材料几天后，九妹就重新因为涉嫌违法被羁押。 姜涯隐约觉得，有人故意要把九妹和魏九“捆绑”在一起置于死地。几天后姜涯得知九妹的证据被认为改动，勃然大怒，咆哮着要揪出内鬼，在市公安局大闹一番之后，他获得了这样一个他不愿接受的消息：是尊副省长下的命令。 为什么，尊副省长如此急切的想要封口魏九，还有九妹？ 带着这个问题的疑惑，仍在停止反省的姜局长亲自到省委拜会尊副省长，当面质问此事，而尊副省长只是语重心长的说了一句：这是我做的有利于整个清水市的最好安排！谈话间，尊副省长还特别提到了九妹的状况，并对姜涯说：如果你真希望还她正常生活，就让她彻底和魏九断了联系，把她送到美国的贵婿大学读书去吧，他可以给九妹写介绍信。 从省委回来，姜涯越发不解和愤懑，但他仍然是想还九妹清白和正常生活的，所以，按尊副省长的意思，九妹顺利出狱，并且安排准备出国，在临行前的一天，九妹特地来和姜涯道谢。 姜涯说：到了美国你就可以有新的生活了。九妹说：警察不会骗人吧？！ 这段时间的相处，让姜涯感觉九妹就像自己的女儿，送她出国或许今生再无机会见面，不舍之满满，但最终，九妹还是如约离开了姜涯进入了贵婿大学。 这边温情的送走了九妹，那边“放虎归山”的魏九并没有闲着，虽然尊副省长在他被重审后的第二天就立刻吩咐了自己的亲信督办这个案子，但魏九脱离了监狱，还是如鱼得水，所有关系网立刻重启，一场魏九的“绝地反击”就要来了。 他撕掉了贵婿大学的遮羞布！ 魏九在宝贵的时间里，发动了一切关系，曝光了位于美国的贵婿大学，原来这所大学是赤裸裸的权钱交易的产物，经调查，该校就读中国学生有半数是清水市内有名企业家的子女，他们被安排在那里读书且不被允许回国！到此，舆论为之哗然，同样，姜涯也大吃一惊，因为他知道，让他送九妹过去的尊副省长，一定和这有脱不了的干系。 与此同时，尊副省长也不顾组织纪律，越级行使权力，给清水市公安局直接施压，让他们以最快速度了解魏九的案子。另一边，得知贵婿大学的内幕后，姜涯内心做了激烈斗争，难道他一直听命于一个不忠于国家不忠于人民的领导？为了证实这个可怕的想法，他总结了近期收集的全部资料，无奈的发现所有的证据都指向尊副省长，在此情形下，姜涯没有忘记自己是一名警察、是一名人民公仆，既然领导队伍中有问题，那就该改正，无奈自己身份，他只得将所有材料交给了媒体。 自此，猎狐行动的始末以及尊副省长和魏九之间的关系终于大白于天下。 时间回到十年前，由汉东省委政法委牵头，省公安厅、纪委监委等部门组成联合调查组，对清水市轴网集团以及市县级领导班子展开全面调查。公安内部行动代号“猎狐”，时值领导班子换届，尊某和魏九作为牵头小组成员，心里都知道行动成败对自己的意义。 同时尊某对魏九的所作所为都知道的非常清楚，虽然尊某也有些问题，但都没触及原则，所以在这方面尊某算是牢牢地抓住了魏某的把柄。猎狐行动开始之前，两人就曾多次私人碰面，后经调查，当时尊某就对魏九以前程为要挟，让其促成猎狐行动的成功，从而让他成功接任副省长之职。魏九无奈，只能答应，他可以“出卖”他的走私利益链，但他要求魏某接任后保留他的权力。 猎狐行动开始前夜，魔鬼契约签订了。 但后来事态的发展，是魏九始料未及的，原来尊某一早就在利用魏九，尊某打算让魏九彻底在官场出局，一是为了干掉主要竞争对手，二是为了掩盖这个“和魔鬼签订的契约”。因此，在猎狐行动后期，尊某已接任省长，但他丝毫没有停止的意思，最后居然把魏九的所有势力赶尽杀绝，这也是为什么魏九非要置尊副省长于死地的原因。 这一切经媒体报道，引发了社会的广泛热议，而姜涯被舆论推上了风口浪尖，不只是因为他的客观公正，更是因为他敢于挑战权力！省市领导班子出现严重分歧和非议，这是上级领导所不愿看到的事，纪委监委介入调查，确认了尊某当年不当竞争的事实，但在任无其他问题且工作作风扎实，暂不对其进行人事调整，而姜涯因为违反组织纪律，被调任其他部门接受进一步的工作安排。 地点：汉东省 from 电视剧《人民的名义》清水市 from 电视剧《使命》南高县 from 电视剧《阳光代表》 人物：尊副省长 - 小九魏九 - 苏妲己（九尾）九妹 - 小九姜涯 - 姜子牙 角色行动名称自行代入，文笔有限，不严谨处请见谅。","link":"/words/9e2f.html"},{"title":"Understand complex tables in one minute","text":"Here you have a normal data table in your hand. It could include thousands of rows and columns, and usually, the items are all numerical numbers, which are hard to understand. Now, your task is to get information from it as much as possible. What can you do with the data? How could you find useful information from it? ExpositionThe general way is to compute some statistical features. But if you want to get a good comprehension of it, you need to find more meaningful features, like clustering information of rows and relationships between different columns. To do this, you can use some advanced methods like principal components analysis which is known as PCA. But the numerical result of these methods is still hard to understand. So, here we introduce visual signals while using these methods. For example, with PCA, you can get a squeezed result, which means the number of rows won’t change but columns could be compressed into 2 or 3. Since columns indicate dimensional information, you can say the dataset is transformed from high-dimension to low-dimension, which you can easily visualize as a scatterplot in the coordinate system. Now, you can get the scatterplot in which every row represents a point, and they could gather into different clusters. We naturally think these clusters are the clustering features of this dataset. And if you assign different colors into different clusters, then you can understand it immediately. Propelling MomentBut the question is that since PCA is just one of so many algorithms, how could you make sure the PCA could give you a proper result. Can you trust it? The short answer is No. We need a way to test it. &lt;&lt; Read more articles in https://www.cxmoe.com &gt;&gt; Divergent Action PhaseHere we compute two kinds of neighbor errors by testing every point in the scatterplot. What are the neighbors? If points are located in a circle area around the one we selected, then we call them their neighbors.We use the classic Euclidean distance to find out all neighbors of each point in the low-dimension scatterplot and the original high-dimension data. Next, we can compare these two kinds of neighbors. For the point of low-dim scatterplots, if its neighbors don’t appear in high-dim data, then we call them false-neighbors. And if the points of low-dim scatterplots miss some neighbors of high-dim data, then we call these missing-neighbors. Crucial EventNow, we get important errors! that could tell you which part of the scatterplot we can trust and which part is totally wrong. Convergent Action PhaseThe next question is how to assign these error messages to our scatterplot? There are several ways to do it. We can use luminance to represent errors with the original scatterplot or we just generate a new scatterplot with colors to show errors.With the above methods, we could have several visual results of the original dataset. SolutionSo now, you have 3 views. Using the scatterplot of PCA, you 1can easily understand the clustering information. And with these error views, we can easily correct the former understanding. Actually, this kind of solution could be used as a general process, we can also compute other types of views to refine our understanding. CodaSo, you can see these visual methods able you to have a good comprehension of the table in a short time. That’s why we call it: understand complex tables in one minute!","link":"/words/8267.html"},{"title":"2020年终总结(A)随便写写","text":"2020年最后一天终于到了，没有什么期待浑浑噩噩的一年到此就结束了，搁心自问获得了什么？好像除了年长一岁，再无其它值得细说的事情，疫情的肆虐完全打乱了正常的学习节奏，还有那种远离家乡的孤独，无法言说。 我是个没太有”良心的人，出门在外便可以于父母于不顾，这种”冷血”或许也是支撑我走到如此地步的原因，不知道这条道路是不是正确的，但不争的事实是，一年光景已逝，空留嗟叹。是想出关之前，也曾假想过生活的美好，但却未曾料到这天灾人祸。当初，这不过是一场不起眼的感冒，谁曾想事情会发展到如此地步。2020年，新冠疫情，无疑是导致今天这一局面的最魁祸首。 章节一：西方价值体系的全面崩塌从年初开始，伴随着中国疫情的不断恶化，以美国为首的西方阵营不断在大洋对岸进行抹黑和唱衰，用”隔岸观火”来形容再合适不过了，但哪曾想，”人共命运共同体”这个概念，会这么快的得到体现，全球的相继沦陷让我们大跌眼镜，在惊诧为什么西方国家如此不甚的同时，西方世界却未曾一刻停止他们的丑恶言论。时值特朗普大选时期，他更是使用所谓的”中国肺炎”来歪曲这次疫情，群情激愤下，中外舆论场展开了一场关于东西方体制的大讨论。 记得几个月前导师也曾问过我为什么中国的防疫做的这么好，这不是一个表象问题，其内在深层次的原因在于制度在于文化，西方的文艺复兴过分强调个体价值和体验，同时期欧洲的小国体制又无法培养一个大国利益集团，从而导致人们普遍的过度关注自身利益，”无恒产者有恒心”，这或许是对中国近代无产阶级兴起的一个有效解释，相比于西方的价值观无疑更具有凝聚力。 另外，我还延伸到了更深层次的儒家文化。中国的传统文化影响同样不能忽视，小到”听妈妈的话”，大到”忠君爱国”，可以说，儒家思想以及忠孝观念自古就被统治者用来约束臣子和人民，所以 中国人的内心普遍存在一把”道德的尺子，这个尺子讲的是于家庭内”顺父母”（孝顺）于朝堂上”顺君王”（忠君），除此之外，才是法律的约束。于此点而言，西方的社会道德，由于家庭结构的破碎，即子女和父母的松散关系，导致人们从小便以”顺自己”为基本价值观，进而影响整个社会管理治理体制的制定，议会制的产生，正是由于”集权寡头”形式无法被人民认可，从下至上，相互影响，这是我以为的西方社会形成的一种解释。 于此早在秦汉时期，东方的中国就开始探索了，事实上，可以说秦朝的灭亡就源于法家思想的弊病，过份依赖严苛的秦法，使民怨声载道，侧面验证机械的执行法条是行不通的，且法律制定者由上层控制，导致法律并不总是以人为本，所以西方民主社会有了立法机构，这一定程度上解决了这一问题，但也让他们过度的追求了”法律的作用”而忽视了文化。所以当西方政府去要求人们居家隔离时，政府反而会成为人民心中破坏自己利益的凶手，当没有文化层面的”妥协”时，那这种”限制”就会转变为”无法认同的不合理”，进而暴发各种抗议行为。你可以说这是公民意识的崛起，这个概念也曾在国内被炒的火热，但今年看来，这种一味追求各体利益的”意识”简直可笑至极，随着基层群众普遍的”认清现实”，以美国为首的西方世界从上世纪末开始的对中国的和平演变可以休矣。 谈完了思想层面，再谈谈制度层面。 当今的西方，无论是美国等大国还是欧洲等小国，均没有成熟的中央政府。例如美国，自建国开始的联邦政府就不对各州政府有绝对的控制。虽有美联储，但依然无法统筹各州政府的运行。这种尴尬的局面，造成了今年的纽约州同联邦政府决裂的现象 。另外，美国的另一问题是，近乎完善的医疗体系均面向富人阶层，诸如呼吸机等稀缺设备均在高级诊所或医院，也就是说平民正常是去不了也去不起的，这在和平稳定的时期不会暴露问题，但当面对疫情时，大量的底层民众需要医疗资源，这时，美国传统的医疗体制就彻底失效了。又因为联邦政府的权力有限，所以无法统筹调度全国资源导致各州政府各自为战， 进而导致拥有”全球最多医疗资源”的国家在如此疫情面前的不堪一击。对于欧洲，情况又变的稍有不同，小政府主义胜行， 导致面对疫情时政府的责任意识不强，过度的遵循公民决议，又导致政策的反复无常和防疫措㢮的严重滞后。在正常状态下，小政府可以给公民比较好的体验，试想你会被邀请针对某具体政策来投票以决定该政策是否执行，这是小国的优势。但也是一切弊病的来源，一体两面有良就有弊，该种体制下，公民被赋予过度的权力，当灾难来临，小政府无法有效组织全体国民，同时由于资本主义国家的运作机制导致资源并不完全掌握在政府手中，在协调资源时，资源生产方和政府的利益并不一定趋同，例如本地厂家会刻意保持口罩的稀缺性，这有利于维持早期的高定价，但无疑对疫情有害，要知道中国可以花50块 买200片口罩，但在荷兰，50片口罩售价就可到80元钱。 &lt;&lt; 更多精彩尽在『程序萌部落』 &gt;&gt;&lt;&lt; https://www.cxmoe.com &gt;&gt; 值得一提的是大国在制度上也是有”纵深”的，这种防疫纵深，可以允许全国省份支援武汉的现象出现，但这需要两个要求，一是强有力的中央政府，二是群众的奉献意识，目前纵观西方世界，无论大国还是小国，都缺少制度优势，群众也缺乏互助意识，所以，除去前期”轻敌”导致的疫情蔓延，亦或是说重视后采取的措施，各个西方国家均不合格，防疫的亮点均在亚州，这和深层次的文化基础是密切相关的。 总之，2020年的新冠，让自由女神之像彻底崩塌，伴随着美国对中国贸易战的完全失败和特朗普的选举失利，中美博弈已经进入中国时间，2021年的”疫苗大战”，相信在分配上西方世界会暴露更多的问题出来。我为什么会如此关注呢，因为在这次的”东风压过西风”的过程中，我很不幸的处在西风里，虽然无奈，但也收获不少，一年的时间，看尽西方国家的各种招数，”帝国主义亡我之心不死”这话现在也适用，对我来说，这一年真就是”眼看他起高楼，眼看他宴宾客，眼看他楼塌了”。有人说在海外时间长了容易被洗脑，但这在我看来完全是错误的理解，公知的误导对国人的杀伤力才是最大的，关于”外国的月亮圆不圆”，我的看法是”一看便知”，切莫相信那水中月，只能让你们竹篮打水一场空。 吐嘈完疫情，好像就没有什么好写的了，这场疫情真的是浪费了太多的时间，到现在为止，我的学校依然没有恢复正常运行， 所谓的”居家办公”和”视频会议”并不能解决长时间居家带来的社交缺乏，所以上半年自己独租时，看电视剧成了消磨时间的方法，仔细想想，或许这还真是个值得拿出来说说的话题。 章节二：在影视剧中沦陷细细想来，《大明风华》是来这里看的第一部局，是2019年的压轴历史剧，像极了今年《大秦赋》的状态。后来，找电影时无意间发现了《上车走吧》，这下让我喜欢上了管虎的作品风格，从此开始，我便看了《外乡人》和《生存之民工》，对现实的刻画太真实深刻了，现在已无人能达到当年的编导水平了。后来把一部苦苦寻找多年未果的老电视剧给看了，那就是中国历史上第一部防疫题材的电视剧《黑菌》，时值疫情肆虐，这个电视剧真就把”封村”、”言论管制”、”官员不作为”等等现象刻画的淋沥尽致，作为一部同时具有些惊悚感的电视剧我看完后感觉意犹未尽，遂找到了另一部甚称前无古人后无来者的恐怖电视剧：《魂断楼兰》，可以说是极尽恐怖气氛，当然也写出了人性的黑暗和无奈。本质是部以惊悚包装的犯罪片。之后一段时间，又看了管虎的一些作品，比如《黑洞》和《冬至》，陈道明的演技，无论是黑恶势力，还是底层银行职员，都演的太棒了，尤其是《冬至》，极尽压抑和绝望，看完真的是让人致郁。而《黑洞》我认为是国产犯罪剧的巅峰了，没有非黑即白，更多的观感，是一种陷入黑暗的绝望。 看过的电视剧，整理下的话，可以按题材分类。 历史剧：《康熙王朝》《雍正王朝》《大明风华》《大秦赋》《楚汉传奇》 反腐剧：《国家使命》《使命》《黑洞》《国家形象》《沉默》《高纬度战栗》大部分是张嘉益作品。 现实题材：《黑菌》《不要和默生人说话》《魂断楼兰》《外乡人》《生存之民工》 看电视剧不仅是消遣，更多的是寻找一种心灵寄托，比如《外乡人》中的包工头，无奈辛酸但却有一邦值得托付的邻里，《民工》中的农民群体，在中国腾飞的大浪潮里，挣扎着维护自己那最后一点尊严。又像是《高伟度战栗》中的劳爷，坚守着那个对党的忠诚和对正义的初心。这些都是使人向善的一发人深思的优秀剧集，可惜随着我们的国家越来越强大，软实力不断的增强，但真正探讨内部问题的剧集却越来越少，现代言情剧，时代追思剧成为日下的主流，欣欣向荣的景象往往会掩盖许多阴暗处的问题，而这些老剧，无疑是很好的反醒催化剂，细细想来，假如现在有人像《冬至》里男主那样私吞钱财，那他会有男主那般内心的挣扎吗，恐怕难矣。 终章现在是31号晚上的十一点半，晚上刚刚和房东家吃过火㶽，算是疫情期间难得的一次聚会了。外面现在是一轮明月当空，稀稀落落的鞭炮声在耳边响着，仔细听远处的广场上还有人在外放音乐，我也想立刻出门加入他们，但现实的状况告诉我不能去，这既是居于他人屋檐下的无奈，也是疫情期间对自己的负责，所以，有时候真得很纠结，既想摆脱他们过属于自己的生活，但疫情却是现实中无情的洪水猛兽每当我有此想法时就立刻在我脑海中出现吓退我。总之，此地好像成了我无法跳跃出去的”舒适区”。 窗外的鞭炮声更密集了，我想，定是无数的家庭在庆祝属于他们的春节。于我而言，上个元旦上个春节，这个元旦及这个春节都将在遥远的海外独自度过，这或许是房东家能给到我的一丝温暖了，但睹物思人，看他们合家团圆的景象，又何尝不是种残酷。 马上就是这里的12点整，也意味着我正式的步入2021，过去的一年无论如何也都随风而逝，能留下的也就只有些记忆碎片了，如果要用几个关键词定义，那我觉得应该是”无奈”、”失望”、”迷茫”、”焦虑”和”孤独”，对疫情的无奈，对政策的失望，对自己未来的迷茫，对现状的焦虑，以及那深深根植于自己内心的孤独。或许这些无奈这些孤独是我人生的财富，但这些实在是并非我所愿，2021年，希望尽快摆脱疫情影响（虽然我知道并不现实），过一个真正属于我的、快乐的、充满斗志和希望的一年。2021我准备好了，来吧。","link":"/words/28d8.html"},{"title":"Some writing pitfalls","text":"Pitfalls are some dangerous areas that most people could stuck in when they write their words. Keep them in mind could be a good way to avoid meeting them, and also you can use these pitfalls to test or valid your exsiting words/sentences to see if you are in or out of them. Absence of emphasisIf your sentence carries no emphasis the message reads like a futile message. Try to change the order of the messages or words in the sentence so emphasis gets back in. ArticlesNotably writers from Asia forget to use articles which are not present in their own language. Please mark articles in a newspaper text and become more aware of them in your own writing BracketsInformation between brackets is best avoided, unless it is a definition of an abbreviation. CommasCommas are ideally placed where you reader should breathe. If this is in your list of pitfalls you do not use them enough, or too often or at the wrong place. EE/endExcessive Endings: If you use double emphasis at the end of a sentence, the movement of the text disappears. If it is completely gone when the text should move on, it is an excessive ending [ee]. If the loss of movement is less severe we tend to add [end] in the text. The question is then if you wanted it to end or not. We doubt that it is the case. GrammarIf this is added in your text we wonder whether the sentence is grammatically correct. In that case expert help on grammar is a good idea, or you can use Grammarly to help you out. LongLong Sentences. Sentences longer than 24 words are difficult to read. Try to make a chain of shorter sentences and play with sentence length for sake of variation. MMMany Messages: We can read one or two messages per sentence. If you have many messages in your sentence you overwhelm the reader. Try to make a chain of simple sentences instead of one complicated sentence. [OB]/strong beginningObnoxious Beginnings: Sentences that begin with big emphasis do not read naturally. In that case you use an obnoxious beginning [OB]. Playing with the order of the messages in the sentence can solve the problem. If the effect is less pronounced we speak of [strong beginning]. In that case it is not a big problem, but it is something to be aware of. Plural/SingularIn English ‘one thing makes’ and ‘two things make’. This is sometimes written in the other way around. Simpler structureSimpler sentence structure: If your sentences are too complex, the complexity obstructs the communication. Try to make a chain of simple sentences instead of one complicated sentence. &lt;&lt; Read more articles in https://www.cxmoe.com &gt;&gt; Simpler wordsIf you use simpler words the message reaches the mind of the reader more easily.[Simpler] More directThis is a combination of simpler structure and simpler words. staccStaccato: Irregular beats in a sentence are called staccato SubSubclauses: Subclauses distract the reader. Please give the information a separate sentence or leave it out. You can also reshuffle the information within the sentence so the subclause disappears. Subclause like structureThe same as subclauses but then more subtly shaped in the sentence. TailTail in the middle of the dog: This is double emphasis in the middle of a sentence Variation in sentence lengthYour text needs more variation in sentence length to prevent the reader from losing attention over sentence length monotony. Please also use very short sentences! Variation in sentence structureIf this is in your pitfall list, your sentence use the same build up. Become aware of that form and try to vary more. Xmas diner paragraphsIf you have a paragraph that covers half a page or more you write Xmas diner paragraphs. For psychological reasons it is best to use lines of white make the reading hurdles doable.","link":"/words/e86a.html"},{"title":"东北亚离战争到底有多远？","text":"这是一部经典的“韩国式”政治剧情片，不过值得称赞和肯定的，是其又继续往前迈了一步，大胆的描绘了东北亚的一次隐晦的热战危机，虽然剧情“浮夸”经不起推敲，但当世界局势真的变得波云诡谲之时，谁又能保证世界不是朝着远离和平的方向前进？ 1. 整体观感战争迷表示吃到饱，将近一大半的篇幅都花在“热战”情节，其中又有一大半集中在朝鲜的核潜艇内，不同势力、不同思想聚集在这小小的潜艇内，在外部超强台风“钢胚”的映衬下，显得格外的渺小，但就是这渺小的一叶小舟，孱弱的维系着美、朝、韩三方的和平对峙，中间又夹杂着中、日两大外部势力的干预，真可谓是战争的“风暴眼”。 全篇的主旨，个人觉得就是片尾韩国总统对人民的发问：你们想统一吗？这句话的深刻含义是，朝韩的半岛统一，决定因素不是中美日外部因素，而是朝韩两国人民。 此主题隐晦的另一面，表现在对“中朝同盟”的否定，这个意图，在电影中表现的很明显，反叛的总督长不止一次的强调“同中国的血盟”，即便临死仍然坚信这一点，为此不惜在计划曝光后仍然（按中方意图）向日本发射核弹，当然“勇敢的”韩国总统跳出来阻止了这一切，他的行为同时也间接影响了美朝领导人的想法，并最终促成了最后的 happy ending. 2. 半岛的排他性在无数次说完佩服韩国电影的脑洞之后，这里必须得再说一次。当然，如果你看多了韩国的战争片，即便是朝韩内战，他们也拍了一大堆精彩的宣扬“朝韩一家亲”的电影。所以把朝鲜领导人“美化”到一定高度，并且和韩国领导人思维在同一层次，这是一种“现实无法达到”的剧情，即便如此，韩国电影依旧热衷于这样做，目的我觉得有二：一是在韩国内部进行“内宣”，维持韩国人的统一情节；二是对全世界说“朝韩不是敌人、是朋友”，这在当下正和文在寅的一些执政思路相吻合。由此种“朝韩一家亲”的情怀推延出来的，是一种“半岛排他性”，其核心就是： 朝鲜半岛的事情由朝鲜半岛自己解决。 这当然是个美好的梦，不仅对面的朝鲜办不到（中国不答应），就连韩国自己也办不到（韩美共同防御条约）。最现实的是：《韩美共同防御条约》存在一天，韩国就不配说这句话，当然在电影情节中是可以说的，不过，在《铁雨2》中，我们可以发现导演故意弱化了美国驻韩司令部的作用，电影里是美国副总统直接远程指挥，到最后是韩国总理给军队下令，这在现实是不可想象的。可以参照一些别的电影剧情比如《白头山》里美驻韩司令部的强势，战时基本可以凌驾在韩国国防部之上。 3. 东北亚离战争到底有多远东北亚包括中日朝韩俄美（驻军）六方势力，这也是所谓“朝核六方会谈”的成员，各个国家内部都有所谓的“鹰派/极右翼”分子，当六方权力均掌握在温和派手中，那自然是地区稳定，但只要一方内部权力斗争，极右翼掌握权力，在各方的制衡拉扯中就会失去平衡，从而导致不可预知的危险举措，进而影响区域和平。这样看来，东北亚局势的核心，目前就在朝鲜半岛，而朝鲜半岛局势的核心，就在失衡的朝鲜一侧，前段时间朝鲜单方面炸毁开城工业园的朝韩联络办公室，就是个危险举动，朝鲜内部的真实斗争我们不得而知，但如果你关注朝鲜的政治，通过支离破碎的报道，也能发现金正恩上台之后对下层官员的清洗，和对权力组织结构的改革，所谓的“先军政治”正在在金正恩的领导下朝“党国体制”过渡，姑且算作是朝鲜的一种改革开放，金正恩掌权下正在力图弱化军队对国家治理的干预，重新将劳动党回归到应有的党的地位，这是一种不走老路的“创新”，势必会有内斗，时至今日，金正恩已经连续多个月没有公开露面，对于他的健康状态的猜测一度成为新闻焦点。 在如此现实下，你还能笑着说，朝鲜很稳定吗？现实是：朝鲜动，则韩国动，韩国动，则美国动，美国动，则中俄动，则日本动，这是种不可停止的“链式反应”，为什么要六方会谈促成“半岛无核化”，就是为了将此反应链的不确定性降到最低，然而事实呢，任重而道远。 影片中，朝美签署和平协议是在2021年7月左右，目前来看，几无可能，当下中美对抗直接硬碰硬，朝鲜在这种情况下已经失去“平衡作用”，美国目前可见的招数基本都打在台湾，或许美国更希望用“台湾牌”这张更“直接”的杀手锏来制衡中国，在这种情况下，朝鲜半岛无核化、以及朝韩和平的日程都要被延后，这就是现实的无情和残酷。 &lt;&lt; 更多精彩尽在『程序萌部落』 &gt;&gt;&lt;&lt; https://www.cxmoe.com &gt;&gt; 4. 朝鲜无核后何去何从这也是《铁雨2》中朝鲜内部产生矛盾的根本问题，放弃核武，朝鲜能换来什么？片中给出的答案实在过于“理想化”，韩国有部分人认为，最好的状态就是达成一种“南北帮扶”，即回归到“朝鲜半岛的事情朝鲜半岛自己解决”，他们认为韩国有能力帮助朝鲜过渡到正常国家，事实如此，但这种情况并不会出现，原因就是中美日俄的影响。 半岛和平稳定自然是好事一桩，但对于周边大国，朝鲜半岛已然成为一个“准”代理人战争场地，朝鲜之于中俄，更多的是一种和“美帝同盟”的“缓冲带”，很不幸，作为一个国家，就是这样无奈，也正是如此，不甘于做“护城河”的朝鲜走了一招险棋，即发展核武，当然这不是一蹴而就，也不能说这违背或顺从了中国的意愿，各方的权力都在变化，不同时代做出的决策也不尽相同，不论如何，历史走到今天，朝鲜已经不单单是“缓冲带”这么简单了，其有了更多的“独立国格”，虽然依旧站在中俄一遍，但却需要更多的束缚，一旦把控不好，其引起的地区动荡会比以往更加严重。 说到朝鲜的核武发展，离不开其假想敌美国的存在，如果美国领导权更替，势必对朝政策会有改变，这对于韩国来说也是一样，政权更迭导致半岛局势变化，这是个不争的事实。目前的状态是：亲北的文在寅+虽然狠但不寻常的川普+有革新思想的金正恩，这是一个历史的契机，共同作用下促成了“金川会”等等一系列“高难度”政治操作，然鹅即便如此，朝鲜也只是做了些许退让，并没有做出什么实质性的操作。可以预见的是，当下没做到的事情，在下一个美国总统任期，也基本是下一个韩国总统任期内，依然很难做到。（目前看川普和文再演都很难连任） 5. 反思我完全赞同将这种“意淫”剧情划为政治宣传的范畴，虽然Low了一点，但只少能让看的人明白一些事情，剧情再怎么YY，只要你看到最后，如果你是个韩国人，那句“你想统一吗”肯定会直击你的内心，这可以算得上是一种高级内宣了吧，对此我们需要多加学习！ 政治剧情片算是韩国电影的一大特色了，而更进一步包含战争因素的也有很多了，以往都是着重在朝韩内战，到后来的“朝韩间谍”情节，再到“反美情节”，例如《战疫》，再到将“中美日”因素全部糅杂在一起，以朝鲜半岛为中心，创造出区域热战甚至是世界大战的剧情，这部《铁雨2三方会谈》不是第一次（《白头山》也是中美朝韩），当然也不会是最后一次，韩国已经成功探索出一条以现实为基础，演绎夸大为手段的政治剧情电影的路线，可以预见类似电影（中美频频出镜）以后会越来越多。 在这方面，我们的表现呢？战争片九成都是抗战或内战题材，发人深思即有内涵的并不多，到了偏剧情的战争片，更是缺乏剧情张力。我觉得诸如《战狼2》《红海行动》等就是不错的探索，虽然更加偏重战争，但总归是包含一些剧情的。港片的《赤道》等也是一种方向，不过其可能需要更加宽松的审核环境。感叹一声，不再赘述。 后记总而言之，这部的三方会谈，铺垫够足、剧情张力够大、结局够完美，作为一部标准的“韩式”YY剧情片，包含有足够量的政治、战争、人文情节，剧情紧凑不拖拉，如果你忘掉《铁雨1》，抛弃现实情节来观影，这绝对可以算一部上乘佳作。","link":"/words/abcd.html"},{"title":"Important rules in English writing","text":"Most young scientists have no clue how to organise their writing, let alone how to get it done. And when they finally do write a sentence, they immediately rewrite it. This struggle continues for months until they end up with a piece of writing that does not make them happy. For many scientists, the adventure of creating new knowledge starts and ends in the nightmare. And that is not a surprise. You did not choose to become a scientist because you liked writing so much. But writing is the endpoint of your research, and it all begins with reading. SentencesSentences are great because they, produce images in our mind (a) have natural rhythm (n) make us curious (a/i) are short and varied in length (n) affect our emotion (i) are clear (n) are intriguing (a/i) spark your imagination (a) seem to lead somewhere (i) use simple everyday words (n) are easy to read (n) are active (n/a) Love to have a smoke. ordinaryLove to have a smoke, he sighed proseLove is smoke, made with the fume of sighs poetry From smoking to Shakespeare in two simple steps, with exaggeration as the means to get there. This is all very nice, but how to apply this to your own writing and develop your skills at the sentence level? The first step is to make sure to write natural sentences. To achieve that, you need to know which aspects of your writing tend to become unnatural. The second step is to make your sentences more activating by improving the texture of your writing. This can be done by subtly exaggerating the nature of your sentences. If your sentence is questioning, it works to make it even more questioning. If the main quality is clarity, it is better to make it even clearer. They are clear and direct because they, convey the message as simple as possible present one idea or one comparison avoid excessive use of subclauses avoid excessive length only provide necessary information potentially enhance the structure* They are natural, so they, have commas to help the reader breathe have natural rhythm with regular beats avoiding obnoxious beginnings avoiding excessive ending avoiding irregular staccato beats avoiding mid-sentence endings use simpler words if possible use an active voice rather than a passive voice have a clear message have their verb and subject not too far apart They exaggerate the natural qualities so they, essentially read like somebody is talking to you continuously draw the attention of the reader* make you see the picture behind the words* are easy to read out loud Sentence pitfall exercises1. Aiming to write as simple as possible [Original]. The evolution of a spatially structured population composed of genetically different species is given by the frequency of a specific species in space and time, that is the fraction of the number of individuals of that species over the total number of individuals. [Better]. A spatially structured population composed of genetically different species evolves over space and time. This evolution we can quantify by the frequency of a specific species. This quantity is the fraction of the number of individuals of that species over the total number of individuals. 2.Presenting one idea or comparison [Original]. From a preventive perspective, it is crucial to identify proactively which persons or population segments run a high risk, and under what conditions, to go through the full pathological trajectory, or to identify such a risk in those who are already suffering. [Better]. It is crucial to identify persons, patients or segments of the population who run a high risk for going through the full pathologic trajectory. From a preventive perspective, we need to do this in a pro-active way. &lt;&lt; Read more articles in https://www.cxmoe.com &gt;&gt; 3.Avoiding subclauses &amp; bracketsThe end of the subclause should then allow the reader to have a natural pause before the original sentence continues with movement again. This example shows how it’s done: This sentence comes to a halt, and that provides the space for a subclause, (pause) after which we can easily get back to the original sentence. Remember two things: You will never be able to write everything down, so you need to be selective anyway. The fact that what you write is true does not mean it should be included. Only write what you really need in order to tell the story. 4.Avoiding excessive lengthsome rules of thumb: A sentence is the expression of a single idea. You really need a good reason to make a sentence longer than a line and a half. If you can’t read it out loud in a single breath, it is probably too long. 5.Only giving necessary information [Original]. Studying the dynamics and fluctuations of pesticide concentrations in lettuce and more specifically the leaves of the lettuce plant that was grown under increased light and UV radiation we found that… [Better]. Studying the dynamics of pesticide concentrations in lettuce leaves, grown under increased light and UV radiation we found that… 6.Possibly enhancing the structure [Original]. You can measure the density using an optical probe or a density sensor. [Better]. You can measure the density using either an optical probe or a density sensor. 12345either ... orneither ... nornot only ... but alsoboth ... andwhether ... or 7.Using commas to help the reader breathCommon uses of commas: Near the start of the sentence, often after an adverb or adverbial phrase (“However, it is still the best option” “By the way, let me know when you’re finished”) To ‘subordinate’, to indicate part of a sentence that is not grammatically necessary, but adds to the meaning, often making a comment on it. (“Everyone turned up, which was great, and was very happy, which was even better”) To separate two halves of a sentence (“If you want to go, I will stay here”) 8.Using natural rhythm8.1 Obnoxious beginnings &amp; excessive endings [Original]. L-arabinose and D-xylose are the most abundant monosaccharides in nature after D-glucose, being major constituents of the hemicelluloses xylan and xyloglucan, and of pectin. [Better]. The most abundant monosaccharides in nature after D-glucose are L-arabinose and D- xylose. They are the major consti-tuents of the hemicel-luloses xylan and xylo-glucan, and of xylan and xyloglucan, and of pectin. [Original]. Xylitol is the first common intermediate of the inter-connected L-arabinose and D-xylose fungal catabo-lism. [Better]. The chemical compound Xylitol is the first common intermediate of the inter-comnected L- arabinose and D-xylose fungal catabolism. 8.2 Staccato Writing In spoken language emphasis is used in a regular way. In writing, this regularity can be disturbed, which leads to unnatural rhythm and difficult reading. The steps to tackle this problem are: Find the points where you trip over the text by reading it out loud.Circle the parts that carry substantial emphasis and look for local concentrations of emphases. Play with the order of words or add words that tend to speed up to make it more smooth. 8.3 Tail in the middle of the dog It best avoided as it causes the latter part of the sentence to come across like an unimportant side remark. The solution is either to remove the last part, or turn it into a new sentence. [Original]. Carbonyl sulphide is the most abundant sulphur containing trace gas in the atmosphere, with an average mixing of 500 parts per trillion. [Better]. Carbonyl sulphide is the most abundant sulphur containing trace gas in the atmosphere. It has an average mixing of 500 parts per trillion. 9.Use simpler words if possiblefind the lofty words and change them for simpler ones. Sometimes it helps to think of an image, example or metaphor for something to make clear what you are talking about. 10.Using active voice rather than passive PassiveThe data were provided by the detector.The electron density has been increasing over time.The medicine was given to the patient every other day ActiveThe detector provided the dataThe electron density increased over timeThe patient got the medicine every other day 11.Provides a clear message12.Having the verb and subject not too far apart13.Essentially reads like somebody talks to you14. Draw the reader’s attention continuously15. Make you see the picture behind the words16. Are easy to read out loudConflict induces in stories.Phase 1: The exposition In the Mr. Bean story the exposition starts at the beginning and goes to the point where he is eager to give a coin. (0:00-0:19 m:s) Phase 2: Propelling moment The propelling moment in Mr. Bean is less dramatic, but very effective. He wants to give a coin, but he only has a banknote! (0:19-0:22 m:s) Phase 3: Divergent Action Phase In the Mr. Bean clip the divergent action phase is of course much shorter. It consists of: being annoyed for not having a coin, trying to walk away, trying to find some change and finally getting stuck, because he has no options left. (0:22- 0:41 m:s) Divergence cannot go on for ever of course. If we keep stacking on problems, the story would never end. To reach a solution we need something that changes divergence into convergence. Some kind of key to solve the problem. Phase 4: Crucial Event In Mr. Bean he gets an idea ‘maybe I can earn a coin myself’. In Romeo and Juliet it is the moment that Romeo does not get the letter. Phase 5: Convergent Action Phase Mr. Bean gets the next idea when he finds his handkerchief, performs his unforgettable dance, and is given a coin by a woman passing by (0:42-1:08 m:s). If you’ve watched the movie and I’d stop there, you’d feel the tension. You want the conflict to be resolved and your desire fulfilled. You know it is just about to happen. But if I do not give it, you will feel the tension because you just love to surrender yourself to a story. Phase 6: Solution This is the moment the conflict is resolved. The Mr. Bean story does have a happy end and he solves the conflict by giving his coin at 1:08 m:s. Phase 7: Coda As we had to deal with a lot of action, trouble and conflict we want to stabilise the situation. To give us time to let go of the tension, we are presented with a bit of nothing. Perhaps some comic relief or a futile conflict from the start that gets solved, leading to a glorious ‘That’s allfolks’. The Mr. Bean story does have a happy end and he solves the conflict by giving his coin at 1:08 m:s. Applying stories in your papers ExpositionYou can of course the beginning of your introduction. ObstacleIn most cases you have an obstacle, otherwise you did not have to do all the work. Divergent Action PhaseThis feels a bit more tricky because we discovered it is about stacking problems, where the situation becomes more complicated and finally gets stuck. With your paper you need to realise that your divergent phase started in your introduction already. There is a default divergent quality in the part where you share what you are going to do, and which question and sub-questions you aim to answer, i.e. where you share an overview of your paper. The only challenge lies in writing the method section as it’s fairly dry. But there are enough divergent action options in your results and discussion section. Crucial EventThe only story feature you really need to turn the second half of your paper into a story is a crucial event. If you have a key insight, or an idea that leads you to solve the conflict, use it here. Convergent Action PhaseWhatever comes after that, can serve as a convergent phase. If you secretly add speed by increasing the event density in this part of your results and discussion section, you can suggest the speed of a converging part while everybody reads a ‘normal’results and discussion section. SolutionAnd finally you present your solution or conclusion to solve the conflict in your paper. Easy, as you do that in a paper anyway. CodaA look at possible future work is excellent material to build a coda with. Writing Process What is a sketch? A sketch can consist of a drawing or a table of contents for that specific section. Whatever it is, you need to have a clear idea what to write before you start the actual writing. If you have that idea, you can do a warming up to clear the pathway from your mind to the page. The easiest warm up is to write about any subject like your neighbours’ dog or the weather. Please write for a set time, and make sure you do not stop writing. When the flow of words stops, you repeat writing the last word again and again until new words start to flow again. That allows you to open up the path from your thoughts to the page.Once you’ve made a sketch and done your warm up, you write your text without correcting it. In the scheme it says ‘write crap’. To be clear, don’t write any crappier than you normally would. The point is to only focus on producing text and to accept anything that is not perfect. Imperfections are for the editing phase. The five phases in the writing processIn the end there is not one generic plan that is the best for everybody, just as writing is not a linear process. You go back and forth many times and that is good, because you do not know what you will write until you write it down. And with every polishing step you become wiser. Whatever the steps are in reality, you will always find that you iterate between the following five phases: The write before you do anything phaseIn which you make plans for your research. Writing will help you to make these plans concrete, tangible and clear enough to execute. The research phaseIn which you do your research and collect material to write about. It is possible to go back to the first phase to change your plans if necessary. The sketching phaseIn which you sketch your article in detail. The writing phaseIn which you do the actual writing. The editing phaseIn which you edit what you wrote. Ongoing…","link":"/words/9aa4.html"},{"title":"Try to explain the projections.","text":"Multi-dimensional data is a very important type of data since it covers almost every kind of dataset. Most of them could be formatted into regular tables or datasheets, where the columns are called their dimensionalities. Researchers already have a lot of experience dealing with these datasets, but in the age of big data, the expansion of the number of dimensionalities (columns) is already made it big trouble for people to handle them. Researchers have created a huge amount of methods to reduce the dimensionality to let people could find insight information in an understandable way. The basic idea is to compute the importance of different dimensions and preserve the principle dimensionalities (PCA). If dimensionality reduced to 2 or 3, then we can understand them, because it’s easy to show them reduce data with 2D or 3D space. But the problem is the losing details could play a big role in the process of our understanding. How to find these missing messages or how to evaluate the result of dimensionality reduction has become a key problem. In other words, giving good explanations to these results is the final aim that we want to reach. &lt;&lt; Read more articles in https://www.cxmoe.com &gt;&gt; With extra interactions, some methods could let people have global explanations by adding axes to the 2/3D space. But they can’t give much more local explanations, meanwhile, the existing methods that have local explanations are all heavily dependent on interactions.Thus, we introduced the image-based method to compute the local explanations. It allows users to get local explanations and could complete the computation in one time without extra interaction. We designed three models to compute the local information and finally created six methods to test. We used more than 20 datasets to test every method and gave detailed illustrations to these explanations we get. Using the intrinsic structure we have known, we verified the rationality of our explanations. Now, this research is still moving on, the future work will focus on the fluence of different parameters, and the evaluation methods for our explanations. With multiple good explanations we computed, we aim to give users more extra understanding so that guide them to choose the best dimensionality reduction method to handle their dataset.","link":"/words/32f0.html"},{"title":"Problems in explanations of projections","text":"At the beginning, we need to know some basic knowleages, well, the multi-dimensional data or high-dimensional dataset are our research objects. And if we project the data from high dimension to low dimension, for example 2 or 3, then we can visualize them and have a direct visual understanding from it. But AS YOU CAN SEE, with these projections, we can’t get what we want, it’s just some points with no meaning. It can be a very good one, with high quality, but what does it SHOW to us?How do we know how the dimensions of the dataset relate to those clusters we see?With only projections, we can’t. So, we need projection-explanations, basically they add information to the projection-scatterplot to help us read what we see in it. Well, there are many available methods ,like biplot axes, it provides a global explanations, meanwhile like tooltips methods, could provide local information but need more interactions. Here in order to get local explanations and not introduce too many interactions. we used a kind of image-based sulotion, we handle the projections as pixels view, and build a mechinasim to compute local dimensional information. As you can see, the dimensionality reduction could be represented as D to P(D), P is actually the project method like PCA or t–SNE. Now we need to clearify our basic principle, that is Good projections should preserve similarity between D and P(D). Here we compute similarity by 2D neighborhood, points in the circle are called Vi, then we can find all matching points MIUi in high-dimensional data. Why do we do that? Because we know that projections should preserve neighborhoods. As you can see in the bottom-left figure, Obviously, the bottom case is better than the top one. It preserves neighborhoods. In Detail, after we get Vi and MIUi, we can use different model to compute the explanations. Here we create six methods, include fan.de.ril and dasilva’s methods. Distance contribution Variance 3 types of local dimensionality computations Dimensions correlation And how we represent our result? It’s easy: We use colors to show the explanation and use luminance to show confidence. So what’s the confidence in out method? Ok, the fundamental idea is: If the explanation of one point that only influenced by one factor, Then the confidence should be high. On the contrary, like the border area, it should be dark. Because they’re influenced by different factors. This is the basic idea, but of course, in different methods we created, we use different formula to achieve this design. Now I’m going to show some details about our explanations methods. The dataset we use here is called Cube data: it has 3000 points, and they are axes-aligned and spread over 3 faces, the projections are generated by PCA. If we see the 3D projection, we can see the intrinsic structure more clear. You can see The first two methods have similar result, because the formula we design is totally the same. The explanations here is bind with the REAL dimensions. Explained the most important real dimensions of each neighborhood. But these two methods have a limitation: The cube here is axis-aligned. However, if that cube is rotated in that high-dimensional space, we won’t get such a clear explanation as we see in the figures here, because each face is explained by MORE than one SINGLE dimension. With this limitation, naturally we want to know how many dimensions we need when we compute our explanations. &lt;&lt; Read more articles in https://www.cxmoe.com &gt;&gt; So we create the local dimensionality explanations. Here are 3 methods, but they have the same basic idea. To show how many dimensions we need to explain the projection. Well I need to Note that, the labels here are the number of Intrinsic dimensions, not the real dimensions. That means if this cube has 100 dimensions(of course many noise inside), the 100 dimensions are its real attributes, we can find them in the dataset, but for each face, they just need just TWO dimensions to explain. This two dimensions are intrinsic dimensions, we can’t give them a name. It’s just a number. So the fact is clear: the explanations here show that faces need 2 dims and borders need 3 dims. It’s easy to understand if we recall the 3D structure again. Now As you can see, we have presented three kinds of explanations (distance, variance, and local dimensionality). They’re all based on 2D projections yet, but it could be extended to 3D projections with the same idea. It’s just technique problems. As I mentioned, they have limitations or just are extensions. So, actually, none of these single explanation is sufficient to understand a complex nD dataset, and there are some parameters that influence our explanations So, we need to put these tools into the test. Trying to understand the structure of some complex projections. And, of course. testing the tools themselves, it brings us extra feedback on the limitations of the methods and also on what kinds of datasets are best explained by these methods. I’ll disscuss this part later. Well, so about the test, we test a big set of dataset, I’ll show you them later, here I’m going to use 2 case, to show how our explanations worked. The first dataset is called AirQuality, it has about ten thousands samples and fifteen dimensions. The dimensions are some value of different gas in the air that gathered by sensors. Indicate the quality of air. As you can see, there are 2 kinds of projections: PCA in the top and t-SNE in the bottom. And each of them we use variance and local dimensionality to explan. Recall the usage of our explanations. In PCA projection, it’s clear that cluster E explained by Nox. Because in the local dimensionality view cluster E just need one dimension to explain. That is Nox.With the same idea we can know that in t-SNE projection, the yellow red and green part could be explained by one dimension or 1 gas here respectively. Besides, for cluster D, with these 2 explanations of PCA, it’s clear that D needs 3 dimensions to explain, they’re 3 gas, CO NH and NMHC. Actually it’s a kind of overlapping. Finally we can see the cluster A, pink area, is separated in PCA projections. Meanwhile in t-SNE projections, it concentrated in just one single area. So, in conclusion we can have good a understanding by using these two explanations. Futhermore it also indicate that for this dataset, t-SNE is performed better than PCA. But… if it’s enough for all cases? Ofcourse not, I’ll give you another example to show that what can we get from 3D projections. In this case, we use segementation dataset, it has 2100 points, 22 dimensionsAs you can see, with variance explanation, it seems not bad, but with figure b, we know that they have more insight dimensions not showed in a). Especially the pink area, it includes a strange high-dimensional banded area. Well, with the two view, we can’t get more information. But here we have 3D explanations, and everything becomes clear. Now we know: the high-dimentional area in figure b is actually the border of yellow and pink part in c. and also, in figure c, we find that the right group shows with green and red, actually is not perfect explained as shown in figure a. Yet I’ve show something that the combination of different explanations can tell us clear and reasonable insight information from these projections.Now, we have 8 explanation views for one dataset. We test 2 project method, pca and t-sne; 2 kinds of explanations, and 2D 3D projections. That’s all we have now in this slides, Of course we want to compute more explanation views. And with these views. We can make a scagnostics-like analysis of the projection. This is the final view we expected. Ok, after the two specific cases, I’ve mentioned that we also test a large set of dataset. Include 2D projections and 3D projections. You can find all the results in the googledrive if you want to check.Of course if you have suitable dataset, welcome to let us know, and let us show you some explanations by our methods. Well What I want to emphize here is that these results are already the good one, we can’t say it’s best but it’s good, we find them manually.This is related to the discussion part. And these are 3D explanations we have. We know that 2D projections are used more frequently in information visualization, but of course we can use 3D projections. And it has been shown that 3D projections are better in catching the structure of the data, becuse, we have one extra dimension to project into! Well the table here shows parameters of good explanations in 2D projections. Of course we can get a rough good value with this. But actually this table could be extended larger with other project methods and other explanations. And we can get more questions from here. what’s the data preference of our methods ? How about 3D explanations compared with 2D ? And as I mentioned these value are founded manually, can we get them automatally? These questions are actually our next works. Ok, then we also discussed with parameter choices. here, we still could find good one in these explanations, but for single one, we have no measure way to know if it’s good or bad. How to evaluate the quality of explanations?? We could make a user study, or we could try to compute the quality by confidence or degree of dispersion. Well finally there still some limitations. as you can see, there are some bad cases. If there are too few points: our explanations cant work well, the methods require to have dense neighborhoods to compute some meaningful explanation. If there are too many dimensions: for most neighborhoods, we can’t select a single dimensions to explain the data. So it shows the default black color. This also lead to a question: Can we explain neighborhood by using a group of dimensions ?? THANKS &amp; END","link":"/words/9727.html"},{"title":"Describe one thing in 10 minutes","text":"If you want to speed up your writing, then you can try this training. Find a quiet place and select some words or objects you want to describe. It’s better to describe some scientific objects since we are training our scientific writing. Think about a word, and just write words, you can write craps but do not change it when you’re writing. Just keep writing until you think you can stop (about 300 words), then you can review what you’ve made, and modify it to the final version. VisualizationVisualization is a very scientific word, which could be seen in lots of papers and involved in almost every research area. The basic idea is to create images or visible objects to represent the numbers or text of the resource data. It is a kind of natural thinking that transfers the information into visual signals. Scientists have found that almost all information we get come from our vision, which means images, animes, or other types of visual objects are the fast way for humans to get information. In detail, the common visual signals include color, size, luminance, texture, etc. With these signals, we can deal with most vision problems. But the new challenge is how to handle the data that include hundreds even thousands of dimensions. Using statistical methods, researchers have created many algorithms to select the special dimensions from data, they can get lots of meaningful results with these methods, but unfortunately, they are all numbers or text, so these unreadable results lead this problem into the visualization field, which could perfectly return understandable results. From here, visualization became more and more important in the data analysis field, especially multidimensional data analysis. Nowadays it has become an independent research area and will continue to play a big role in every research field. Image-based methodWhen dealing with the dimensional data, images always used to represent the final project result. It could show some information like clusters, density, or overlappings. But that’s all comes from the image itself, we can’t get any information from the original data once we get the final image. If we want to build a mapping between them, like using an area in an image to finding the matching points in resource data. The traditional methods usually need to create a structure to store all point location, which is very complex and only support a small number of points. In this kind of case, Image-based methods could have a good performance. For most scatterplots, the images are generated by the real result of algorithms, the key point is that there is a connection for every point between numbers and images. We can use this kind of connection to solve the above question. With the pixels computing, it could execute with a fast speed and don’t need much middle control since it runs the same operations for each point. &lt;&lt; Read more articles in https://www.cxmoe.com &gt;&gt; Web application(not about research, just something different) Nowadays, web applications have become a very important part of our daily life. What is the web application, compared with traditional applications, it should not contains heavy back-end components, and should easy enough to build and deploy. Specifically, they usually programmed by pure front-end languages like Javascript/Html/CSS or introduce the support of back-end with Nodejs, Vue, or React. For the most front-end developer, build a complex environment is always the boring and annoying part when they want to write and publish something. Find an easy way to do that is a common idea for every one of them. Now some public service producer like Github and Vercel has supported the hosting service that allows users to deploy their static resources on the servers. This is a big step, which means without building any servers by themself, and publish their content on the Internet. Now, not only the programmer, but also lots of students, bloggers, or companies start to use this service to show their content on this freeway. Unfortunately, there is no service to support the back-end for Github or Vercel. At the same time, Glitch appeared and brought a brand new service, which allows users to create applications with Nodejs. Besides, they also have an online coding system that could edit and publish with the browser. When users create an application, Glitch will start a docker service. With this kind of virtual technique, they could support building thousands of applications every day. This is a really amazing service, that could let a big group of people program a more complex project without any local environment.","link":"/words/1489.html"},{"title":"Cut off the tail [redundant parts]","text":"This is a training for shorten your words. Writing craps could help us make enough words in a short time. But now we need to focus inside: cut off the sentences or descriptions that are not related to your writing objects. Training this with three phrases: write 300 words to describe one thing, then shorten it to 200 words, and finally 100 words. Compare these three versions you can find the strange parts in your words. Phrase A - 300 wordsIn order to compute the similarity between the low dimensional projections and high dimensional source datasets, we create a way to connect them. Since we know that the process of dimensionality reduction is like a black box, so it is hard to find out the match point of the source dataset in projections. Thus we used an inverse way to build the matching. In 2D projections, we can combine the pixels information with every point. Then, for each point, we can find the matching point or items in the source dataset. Because we have all information with the source data, we can achieve this by programming. After doing that, we connected the points in low and high dimensions. Next, what we did is to compute similarity. Based on the same idea, we still focus on the low dimensional projection. We select one point/pixel, and compute a circle area around this point When we get the neighborhoods, we find all of their matching points. Finally, we used Euclidean distance to compute these two sets of points. Besides, considering the process of computing are almost same as the variance computing, so we also create methods based on variance. Now, we have built a new brilliant mechanism to compute similarity. The next step is to test the way to compute distance. We choose more than 10 datasets and made a set of experiments for the case study later. After getting our explanations, we tried to explain what our explanations showed. From our test, we found a suitable range for parameters for most cases we tested. &lt;&lt; Read more articles in https://www.cxmoe.com &gt;&gt; Phrase B - 200 wordsWe create a way to compute the similarity between the low dimensional projections and high dimensional source datasets. Because the process of dimensionality reduction is like a black box, so we used an inverse way to build the matching. Because we have all information with the source data, we can find the matching point or items in the source dataset. After doing that, we connected the points in low and high dimensions. Next, we compute similarity. based on the same idea. We select one point/pixel, and compute a circle area around this point When we get the neighborhoods, we find all of their matching points. Finally, we used Euclidean distance to compute these two sets of points. Besides, considering the process of computing is similar with the variance computing, so we also create methods based on variance. Now, we have finished the way to compute similarity. We choose more than 10 datasets and made a set of experiments for the case study later. After getting our explanations, we tried to explain what our explanations showed. From our test, we found a suitable range for parameters for most cases we tested. Phrase C - 100 wordsWe create a way to compute the similarity between the low dimensional projections and high dimensional source datasets. We used an inverse way to build the matching. Because we have all information with the source data, we can find the matching point or items in the source dataset. We select one point/pixel, and compute a circle area around this point when we get the neighborhoods, we find all of their matching points. Finally, we used Euclidean distance to compute these two sets of points. Besides, we also create methods based on variance. We choose more than 10 datasets for the case study later. After getting our explanations, we tried to explain what our explanations showed. From our test, we found a suitable range for parameters for most cases we tested.","link":"/words/9731.html"},{"title":"Summary of 2020 - Part B","text":"God gave Adam and Eve an apple, but they fed it to the pigs. Pigs were born in order to die, even after eating the forbidden fruit, they still couldn’t understand these words. VG %0kYXkg aXMgdG hl IGR heS B0 aGF0 IEkgc mVidWlsZC BteS BibG %0n IGx hc3QgeWV hci%5gSS Bwc mV mZX IgdG8gdXNl IHRo aXMgZGF0ZS B0by ByZWN hbGwgbXkgbGFzdC B3 aG %0sZS B5ZWFyLi BNYXliZS B5b3 Ug aGF2ZS ByZWFk IGFub3RoZX IgYXJ0 aWNsZS B hY m %0%2dC BzdW%2tYXJpe mluZy B0 aG UgcGFzdC B5ZWFyLC BidXQg aXTigJlz IG%2vc m UgYWJvdXQgbXkgdG hvdWdodHMgb m %00 IG%25 IHJlYWwgZX hwZXJpZW5jZSwgc28gSS BwbGFu IHRv IGRv IHRo aXMg aGVyZS%5gQWxs IHdvc mRz IGFyZS Bib3VuZC B3 aXRo IHRoZS Bw aG %00b3MgSS B0b2 %0rLi BOb3cg aXTigJlz IHRpbW UgdG8gc2F5 IGEgc mV hbC Bnb2 %0kYnll IHRv ID IwMjAu PGZ hb mN5Y m %0%5Pgo8 aW%2n IHNyYz0i aHR0cHM6Ly %0jZG%5u anNkZWxpdn Iub mV0L2doL%2RpYW5 ab25nbGluL3R%2Y2 h%2YW5nL2ltZy8yMD IxMDEyNz IzMzMzNyAoMSkucG5n Ii8+CjwvZ mFuY3lib3g+CiA= QXQgdG hl IGJlZ2lub mluZy BvZi B0 aGlz IHllYX Is IGFz IGEgb mV3 IF BoLkQu IHN0dWRlbnQg aW%5gYS BuZXcgY2FtcHVzLC B h IG5ldy Bjb3VudHJ5LC BJ IGV%5cGVy aWVuY2Vk IGEg aGFyZC B0 aW%2lLC BJ IGN hbGwg aXQg%5oCc aGFyZOKAnS BiZWN hdXNl IGl0 IHJlYWxseS BtYWRl IG%2l IG hlbH BsZXNz IGFuZC Bjb25 mdXNlZC Bzb2%2ldGltZXMu IFRoZS B3b3JzdC B0 aGluZy Bpcy B0 aGF0 IEkg aGF2ZS B hbG%2vc3Qgb m8gYXNz aXN0YW50 IHRv IG h hb mRsZS B0 aG UgcHJvY mxlbXMgSS BtZWV0LC Bs aWtl IHJlbnR hbC Bpc3N%2ZXMgb3 Igc mVz aWRlb mNl IGRvY3VtZW50cy%5g U28s IEkgYWN0dWFsbHkgZG %0u%5oCZdC BoYXZl IGEgd mVyeS Bnb2 %0k IGFuZC BzbW %0vdGggc3R hcnQu IEF0 IHRoYXQgdGltZSwgSS BuZWVk IHRv IHJpZG UgdG8gdG hl IHVu aXZlcnNpdHkgZXZlcnkgZGF5LC BpdC B0b2 %0r IG%2l IGFib3V0 IG %0uZS Bob3Vy IG %0u IHRoZS Byb2FkLi BOby BtYXR0ZX Igc mFpb mluZy Bvci B3 aW5kLC BJ IHRy aWVk IHRv IGRv IHRoYXQgbGlrZS B h IG5vc m%2 hbC BzdHVkZW50LC BidXQgdG h hdC B3YXMgc mV hbGx5 IHRpc mVk IG %0 m IG%2lLC Blc3 BlY2l hbGx5 IGZvci B h IHlvdW5n IG%2 hbi B0 aGF0 IGRpZG7igJl0 IG%2 h a2 UgZ m %0vZC BieS Bo aW%2zZWx m IGJlZ m %0yZS%5g U28s IGlu IG %0yZGVy IHRv IHNpbX Bs aWZ5 IHRoZS BlYXRpb mcs IEkgc3R hcnQgdG8gZWF0 IGF0 IHNj aG %0vbCwgYW5k IGJyZWFkLC BzYW5kd2lj aGVzLC Bvci BoYW%2idXJnZXJz IGJlY2FtZS BteS BtYWlu IGZvb2Qu IFJlY2FsbC B0 aG %0zZS BkYXlzLC BJ IHN0 aWxs IGNvdWxk IGZlZWwgdG h hdC Br aW5k IG %0 m IGZlZWxpb mc6 IG5vdC B0YXN0eS BidXQgSS BjYW%5gZWF0 IHRoZW0gYWxsLC BqdXN0 IGZvci B mZWVk aW5nLi Bb%5o aRXQ== VG hl IG5leHQgdG hpb mcgSS B3YW50 IHRv IHNoYXJl IHRob3Nl IGR heXMg aXMg%5oCcc2Nob2 %0s IHRpbWXigJ0s IHdoYXTigJlz IHRo aXMgbWV hbj8gc2ltcGxl IS BqdXN0 IGF0dGVuZC BsZXNzb25z IGFuZC BsZWN0dXJlcy Bs aWtl IGEgb m %0ybWFs IHN0dWRlbnQu IFNvdW5kcy B3ZWlyZC By aWdodCwgY mVjYXVzZS Bsb25n IGR hc mtuZXNz IHdpbGwgY2 %0tZS Bpbi B0d28gbW %0udG hz IGx hdGVyLi BTbywgSS BjYW%5gc2F5 IHRoYXQgSS BoYXZl IGJlZW%5g aGVyZS B mb3 IgYWJvdXQgb25l IGFuZC B h IG h hbGYgeWV hcnMs IGJ%2dC BJ IGp%2c3QgZX hwZXJpZW5jZWQgbGVzcy B0 aGFu IG h hbGYgYS B5ZWFy IG %0 m IHN0dWRlbnQgbGl mZS%5gSW%5gS mFudWFyeSwgSS B hdHRlb mRlZC B0 aG Ug aW50c m %0kdWN0 aW %0u IGNvdXJzZS BvZi BQ aC5ELi B hb mQgbWV0 IHNvbW UgZnJpZW5kcywgc2 %0tZS BvZi B0 aGVt IGFyZS B hbHNv IHRoZS BjbGFzc2%2 hdG Ugb2YgbXkgb3RoZX IgY2 %0%2cnNlcy%5gVG hpcy Br aW5k IG %0 m IGxpZ m UgZGlk IG5vdC BrZWVw IGZvci B h IGxvb mcgdGltZS B hcy BJ IHN h aWQs IHNpb mNl IHRoZS BiZWdpb m5pb mcgb2YgTWFyY2gs IHRoZS BDb3ZpZC0xOS BjYW%2l IG hlc m UgYXMgYWxs IH Blb3 BsZS Bwc mVk aWN0ZWQs IHRoZS Bvb mx5 IHF%2ZXN0 aW %0u IGlz IG hvdy B0by BkZWFs IHdpdGgg aXQu IEkgdG hpb msgdG hl IGdvd mVyb m%2lbnQg aGVyZS BtYWRl IHNvbW UgYWJzb2x%2dG Ugd3Jvb mcgYWN0 aW %0ucy B hdC B0 aG UgY mVn aW5u aW5nLC B3 aGlj aC BtYWtlcy B0 aG Ugc2l0dWF0 aW %0u IGJlY2 %0tZS B3b3JzZS B hb mQgd2 %0yc2 UgYXQgYS B mYXN0 IHNwZWVkLi BG aW5 hbGx5LC BpdC BjYXVzZWQgdG hl IGdvd mVyb m%2lbnQg aGFk IHRv IGxvY2sgZG %03bi B hbGwgcHVibGlj IGZ hY2ls aXRpZXMgYW5k IGtlZXAgcGVvcGxl IHdvc msgYXQg aG %0tZS%5gW+KGkV0K IA== PGZ hb mN5Y m %0%5Pgo8 aW%2n IHNyYz0i aHR0cHM6Ly %0jZG%5u anNkZWxpdn Iub mV0L2doL%2RpYW5 ab25nbGluL3R%2Y2 h%2YW5nL2ltZy %0OSkQtNDMtMT Uu an Bn Ii8+CjwvZ mFuY3lib3g+ U28s IGZyb20gTWFyY2gs IEkgdG %00YWxseS BiZWN hbW UgYS Bob2%2lLXN0dWR5 IHN0dWRlbnQs IG5v IGZy aWVuZHMgY2Fu IG%2lZXQs IG5v IGNvbW%2%2b mljYXRpb25z IHdpdGggb3RoZXJz IGZ hY2 UgdG8gZ mFjZSwgYWxs IHRo aW5ncy BJ IGN hbi Bkby Bpcy B0by BzdGF5 IGF0 IG hvbW UgYW5k IH BsYXkgJi BzdHVkeS B3 aXRo IG%25 IGNvbX B%2dGVyLi B U aG UgZ2 %0vZC BuZXdz IGlz IHRoYXQgSS BzdGFydC B0by Bsb3Zl IG%2 h a2luZy B mb2 %0k IGF0 IHRoYXQgdGltZS%5gSS B0c mllZC B0by BtYWtl IG%2 hbnkg a2luZHMgb2YgZGlz aGVzLC B0by BiZS Bob25lc3Qs IEnigJlt IGFtYXplZC B hY m %0%2dC BteS B hY mls aXRpZXMu IFNvbW UgZ m %0vZC B0YXN0ZWQgb m %00 IGJ hZCwgdG h hdC BtYWtlcy BtZS BoYXZl IGEgY mVs aWV m IHRoYXQgSS BjYW%5g aGF2ZS B h IGdvb2QgbGl mZS Bld mVu IEkgbGl2ZS B hbG %0uZS%5gSS Bk aWRu%5oCZdC B0cnkgdG hpcy BiZWZvc m Ugc2luY2 UgQ2 hpb mVzZS B%2b ml2ZXJz aXRpZXMgcHJvd mlkZS B hbGwgc2Vyd mljZXMgZ m %0y IHN0dWRlbnRzLi Bb%5o aRXQo= T25l IGFub3RoZX IgdG hpb mcgSS BuZWVk IHRv IG%2lbnRpb2%5g aXMgdG hl IG hvc3Rlci BvZi BteS B m aXJzdC ByZW50YWwgcGx hY2 Uu IE hl IGlz IGEg UGFr aXN0YW5p IGFuZC B2ZXJ5 IGxp a2 UgbW UgY2F%2c2 UgSeKA mW0gQ2 hpb mVzZSwgSS B3c m %00ZS Bzb2%2l IHdvc mRz IGFib3V0 IG hpbS Bpbi B0 aG Ugc3VtbWFyeS BvZiAyMDE5LC BidXQgSS BzcGVudC B hb m %00 aGVy IGZvdX IgbW %0udG hz IHdpdGgg aGlt IGlu ID IwMjAs IGFuZC B3ZS BoYXZl IGEgZ2 %0vZC B0 aW%2lLC BoZS B hZ3JlZWQgdG8gc2 hvcnQgdG hl IGNvbnRyYWN0 IHNv IHRoYXQgSS BjYW%5gbW %02ZS BvdXQgdG8gdG hl IH BsYWNl IHRoYXQgSS Bs aXZl IGlu IG5vdy%5g U2 %0tZXRpbWVz IHdl IHdpbGwgdGFs ay B hY m %0%2dC Bzb2%2l IGludGVyb mF0 aW %0uYWwgb mV3cywg aG Ugc mV hbGx5 IGxp a2Vz IHRv IHR hbGsgYWJvdXQgdG hl IHJlbGF0 aW %0uc2 hpcHMgY mV0d2Vlbi BQYWtpc3R hbi B hb mQgQ2 hpb mEs IGFuZC B hbHd heXMgdG8gc2F5 IHNvbW UgY mFk IHdvc mRz IGFib3V0 IEluZGl hLi B U aGF0%5oCZcy B m aW5ueS B hb mQg aW%5gYW5vdG hlci BwZXJzcGVjdGl2ZSwg aXQgYWxzby B h IHNpdHV hdGlvbi B0 aGF0 IEkgcHJ hY3RpY2 UgbXkgRW5nbGlz aC BzcGV h a2luZy%5gW+KGkV0= PGZ hb mN5Y m %0%5Pgo8 aW%2n IHNyYz0i aHR0cHM6Ly %0jZG%5u anNkZWxpdn Iub mV0L2doL%2RpYW5 ab25nbGluL3R%2Y2 h%2YW5nL2ltZy %0OSkQtMy0xNSAoMSku an Bn Ii8+CjwvZ mFuY3lib3g+Cg== SS B mb3JtYWxseS Btb3ZlZC BpbnRv IHRoZS BuZXcgcGx hY2 Ugb2%5gTWF5 IDFzdC%5gSS B hZG%2pdC B0 aGF0 IEnigJlt IG h hcH B5 IGFuZC B2ZXJ5 IHN hdGlzZ mllZC B3 aXRo IGV2ZXJ5dG hpb mcg aGVyZS B hdC B0 aG UgY mVn aW5u aW5nLi BCdXQgYWZ0ZX IgdG hl IG %00 aGVy IHJvb2%2tYXRl IGJ hY2sgdG8gY2 hpb mEs IEkgY mVjb2%2l IHRoZS Bvb mx5 IG %0uZS B0 aGF0 IGxpd mVz IG hlc m Ugd2l0 aC B hbi BvbGQgY2 %0%2cGxlLi BJ%5oCZbGwgd3JpdG UgYWJvdXQgdG hpcy BsYXRlciwgb m %03LCAgbGV0%5oCZcy BqdXN0 IGtlZXAgZ2 %0vZC BtZW%2vc mllcy Bub3cu IC Bb%5o aRXQ== VG hl IGZpcnN0 IHRo aW5n IEkgb mVlZC B0by BlbX BoYXNpe m Ug aXMgdG hl IGVud mlyb25tZW50Li B U aG Ug aG %0%2c2 Ug aXMgbG %0jYXRlZC BuZWFy IGEgc ml2ZX IgYW5k IGNsb3Nl IHRv IGEgY mln IGNvbW%2lc mNpYWwgY2VudGVyLi BJdOKA mXMgc mV hbGx5 IGNvbnZlb mllbnQgdG8gbGl2ZS BoZXJlLC B hb mQgSS B hbHNv IGZvdW5k IGEgY mFkbWludG %0u IGNsdW Ig aGVyZS%5gSW%5gdG h hdC BzdW%2tZX Is IHRoZS Btb3N0 IGV%5cGVjdGVk IHRo aW5n IGZvci BtZS Bpcy B0by BwbGF5 IGJ hZG%2pbnRvbi B3 aXRo IG%25 IHJvb2%2tYXRl IGlu IHRoZS BjbHViLi BJ IGN hbi BzYXkgSS BzcGVudC B hbi BleGNlbGxlbnQgc3VtbWVyLC B0 aGlz IGlz IG5v IGRvdWJ0 IS Bb%5o aRXQ== PGZ hb mN5Y m %0%5Pgo8 aW%2n IHNyYz0i aHR0cHM6Ly %0jZG%5u anNkZWxpdn Iub mV0L2doL%2RpYW5 ab25nbGluL3R%2Y2 h%2YW5nL2ltZy %0R Ue a IquWbvj IwMjAxMj I0MTY0MjE2 ICgxKS5qcGciLz%5KPC %0 mYW5jeWJveD%5K VG hl IG %00 aGVy IGlz IGZvb2Q h IFRoYXQgb2xk IENo aW5lc2 UgY2 %0%2cGxlcy B hc m Ugc mV hbGx5 IGxp a2 UgbWFr aW5n IGZvb2QgYXQg aG %0tZS%5g U2luY2 UgdG hleS B hc m UgbW %02 aW5n IG hlc m UgZ m %0y IGxpd mluZy B0b2dldG hlci B3 aXRo IHRoZWly IGR hdWdodGVyLC Bpbi Bzb2%2l IHRlc m%2zLC B0 aGV5 IGRvbuKA mXQg aGF2ZS B hbnkgYWN0 aXZpdGllcy BoZXJl IHNv IHRoYXQgbWFr aW5n IGZvb2QgY mVjb2%2lcy B0 aGVpci BtYWlu IHR hc2sgZXZlcnkgZGF5Li B Bcy B0 aG UgcGljdHVyZS Bz aG %03cywgSS B hdG UgYS Bsb3Qgb2YgQ2 hpb mVzZS B mb2 %0k IG hlc m Us IGN hbi B5b3 Ug aW%2 hZ2luZT8gVG hleS BjYW%2l IGZyb20gb m %0ydG hlYXN0ZXJu IGNo aW5 h IGFuZC BJ IGZpb mlz aGVk IG%25 IE%2 hc3RlcuKA mXMgZGVnc mVl IGlu IFNoZW55YW5nLC Bzby B0 aG UgZ m %0vZC ByZWFsbHkgbWFrZXMgbW UgZ mVlbC BJ IHd hcy BzdGlsbC Bs aXZl IGlu IENo aW5 h IS Bb%5o aRXQo= PGZ hb mN5Y m %0%5Pgo8 aW%2n IHNyYz0i aHR0cHM6Ly %0jZG%5u anNkZWxpdn Iub mV0L2doL%2RpYW5 ab25nbGluL3R%2Y2 h%2YW5nL2ltZy %0OSkQtMy0xNSAoMyku an Bn Ii8+CjwvZ mFuY3lib3g+ VGltZS Bnb2Vz IHRv IHRoZS Blb mQgb2Ygc3VtbWVyLC Bvb m Ugb2YgbXkgZnJpZW5kcy BzdWdnZXN0 IHVz IHRv IHRyYXZlbC Bzb2%2lcGx hY2 Ugc2luY2 Ug aG Ugd2lsbC BiYWNr IHRv IENo aW5l IHNvb2%5u IEZpb mFsbHks IHdl IGRldGVybWluZWQgdG8gZ28gdG8gdG hl IFRleGVs IGlzbGFuZCwgd2 Ug anVzdC BzcGVudC Bvb m UgZGF5 IHRoYXQgYXJy aXZlcy B0 aGVyZSwgcGx heSwgYW5k IGNvbW UgY mFj ay%5gQWx0 aG %0%2Z2gg anVzdC Bvb m UgZGF5LC BpdC BzdGlsbC B2ZXJ5 IGltcHJlc3Npd m UgZ m %0y IG%2lLC B mb3 IgYWxs IG %0 m IHVzLC B3ZS BtZXQgdG hl IG%2vc3QgY mV hdXRpZnVs IHN%2bnNldCwg IHdl IHN hdy B0 aG Ugb2NlYW%5gZ m %0y IHRoZS B m aXJzdC B0 aW%2lLi B Bb mQgSeKA mW0gZ2x hZC B0by BoZWFy IHRoYXQgbXkgZnJpZW5kcy Bn aXZl IG%2l IGEg aGln aC ByZWNvbW%2lb mR hdGlvbi B mb3 IgbXkgcG hvdG %0nc mFw aHkgc2tpbGxzLi B U aGlz IGlz IHRoZS B m aXJzdC B0 aW%2l IGZvci BtZS B0by Bic mluZy BteS BjYW%2lc mEgdG8gdHJ hd mVs IHdpdGggb3RoZXJzLC B hb mQgSS Bkby BtYWtl IHNvbW Ugd2 %0uZGVyZnVs IH Bob3Rvcy BvZi B0 aG UgbGFuZHNjYX Blcy%5gW+KGkV0= PDwg U mV hZC Btb3Jl IGFydGljbGVz IGlu IFtodHRwczovL3d3dy5jeG%2vZS5jb2%2dKG h0dH BzOi8vd3d3L mN%5bW %0lL mNvbSkgPj%5= PGZ hb mN5Y m %0%5Pgo8 aW%2n IHNyYz0i aHR0cHM6Ly %0jZG%5u anNkZWxpdn Iub mV0L2doL%2RpYW5 ab25nbGluL3R%2Y2 h%2YW5nL2ltZy %0OSkQtMy0xNSAoNCku an Bn Ii8+CjwvZ mFuY3lib3g+ CkF mdGVy IHRoYXQgdHJ hd mVsLC B3ZS BuZXZlci Bnby BvdXQgYW55bW %0yZSwgYnV0 IHdl IHN0 aWxs IHRyeS B0by B0YWtl IHNvbW UgY2 h hb mNlcy B0by BtZWV0 IGV hY2ggb3RoZX IgZ mFjZS B0by B mYWNlLi BJbi BPY3RvY mVyLC B hbi BpbX BvcnR hbnQgdGltZS Bwb2ludC BjYW%2l IG %0%2dCwgSS BtZXQgYS B mc mllb mQgdG h hdC Bs aXZlZC Bpbi B hbi B%2c mJ hbi B hcGFydG%2lbnQu IFdpdGgg aGlz IG hlbHAs IEkgbWV0 IGFub3RoZX IgZ ml2ZS B mc mllb mRz IS B U aGV5 IGFsbC Bs aXZlZC Bpbi B0 aGF0 IGFwYXJ0bWVudCwgd2 hpY2ggbWFkZS BtZS BkZXRlc m%2pb m UgdG8gbW %02ZS B0 aGVyZS%5gVGlsbC Bub3cs IHdl IG h hd m UgYWxyZWFkeS BtZXQgYWJvdXQgdGVu IHRpbWVzLC BJ IGFkbWlyZS B0 aG Ugc m %0vbS B0 aGV5 IGxpd mVk IGluLC B3 aGlj aC Bpcy B2ZXJ5 IGJpZywgY2xlYW%5gYW5k IGNvbWZvcnR hY mxlLi BGc m %0t IHRoYXQgdGltZSwgSS BtYWRl IGEgZGVj aXNpb2%5gdG h hdC BJ IGRv IHdpbGwgbW %02ZS BoZXJl IGFuZC Bs aXZl IHdpdGggdG hlbSEgW+KGkV0= U2FsdGVkX%2 %0DOwj/ UGWx %0FWARzvWnx Idb h mbQ3 IQ%5Nq aigCD06%5SyNbd B %05LPKjRg IERHkPeQ57 %0 Unx BWk BLHv+P UZsVCypKkbyfNK2%5i6svQLywVus6xw5y7Exs mzRti%5 a%5CfKQVs/ BsYYOjZgPYPsGdbcrHy5E0+z/7 a/ UiOYiro mgQX h%5RNqn+3 mGkV hL UK3n%5C0iY U IqpjR8YM a%2Qo6S6pTkrjQW BV hVHTqwjJZ2/sFdiQxru/QidoNAPfHL%2tW%5kkyRMPd5%2jxlgNWv7Fxlfpwndnx %0g7nRwJ5 %07dKerOldcXzj5ZLcEF BnlFzWRAAqZT m aTHw%2VT hi UngyK5O I8PDW UTe/ Bwl %0rPAdcngD BVCgAFLWSg miWD B8 h6TX%5%5JHoFu hWwKcwj6 a8b2W%2Sb %0Ky3Lp/qH hek aWMXXxPtNq3WtNW0PHjeNnbHi6c6s m8xoQfqkK %0QqXzpwgf5yWZYpguO3J IwlD7EJLADCX57EdJu aM37icOzcixNW Bgrl %0fD%2bqysAYoTVO8T B3eyKiZqTpH %0JGn3p hr hzjp+QVs IVHunvJsbKXqPW7C7xkW5 mEEWkbZZfy%5PAKoA mfQis%5bSWTxdffvFsoe%2 I BK7LHF58WMKpDOWCbFjknWyF3 IWQAKn%2roqAvZHXyrd aW aA U2EX%2uQlpGZyMi hMjfdbT%2pDT%2esxFK0u%2/pXtPT mG/PH7X75FWQpdbJH2 mu hr3iq2wZLy82YD avCWQlR0 Bq8xn+%2D %0gAFoYl aNcHQ8lOSXNJgSN2wRDVTknzODG heW5 mVt0AMzSf h/ %0Vr5sP BPWKGQkC5oCL0TSnoAey%5GD/ BV5%5bK7YnL %0k mo/DeO U UWy mMHu8E/0r/Ny+b67fub7znH7dz IEW3p0 BG %0c%2N8cKkukWsFLFvlF8K7CG+Wgz5Kgw BbQQq8sV6HQ7dN%2n IA6TulL UYtJpHA+jbSLFcTQiRc3TbiE Ul h85GW%2 m %0Klr aALA5C UFsGK3PPbjqDd%5%2suHof%2W%5EOKbRr2/ mnjNcfso mVVlf8qGbqWz aXT+6eJ BzCuFoGuX850wbcXWuDPSOZfAV85dJc ar3+r0zZ/dW%2 abwHwk I6HuY mCndX3nrAozLLsyGxsJLCTZ BwY %07rgSVkY/7 hsQPg8HCN UGcFzsD6NrSC8vqLYfyv0DiRSXPYgYZR8As3Hv7nt5sq83Oz7Er %0fr80 UH hPO7vHgiqR3NKH2/fpDbdq %0Y0j%5qMsqGWCwtiR I%2tfnlXpO3PPpROTWP UKSNn2Zr7rFoMe0KqG0b hS0onFGdueg aoFA I%2JkqHoP a37b%2Zz hp BbcOlVQiK5%2 BQp%2fct/ZfMc2 Iyt aXT IC8lSb BA6JoT7p6S8lFwyws aGL6yk IFZv%5T2WD%5 a%2M0eCyJdFGH By+ htCKiEjJMn %0XCGEOWkYC a hb hyqOyk %0n h0/l BkPfpLi8ojqQW m/Xl apy%2+y mRLED3bQzdMuKcG%5VZYxEM hL+2owX7%5Lj/GOiHJYcYXSCPwQJR02gqE2ZAl+Ys8 m3bF hD Io aZcHHqXto6PNEkQylTF7O7GQCkSNPswXl m7c UlAlwjLt8vEXxON adpoP8GouMg%2T %0kpuVoqCRdr/RoeZ%5 h6Rube6AuK0uPTt2vG %0K3t2EvLEeb5g68qrr5qAA%2NqFzr %0NQX BXvqj2RDMOjdJGvfK UQ6pzDHYl mTrOd m hSMeSKvVs5S Urn0iccVnnfb%5zc hoHoRtEFzxNKuYVvHTypC/bQZMOn0 I UVV IqEs%2lOsRbnxYrnCpCVx%5f B7ycux BZRR0%2MOpgSpJt6%2O0E UeSxHM2q/0 BNFluKL Ie6MrHN8x+ Up+ hWPlMXnHonHyonp IKMz BY Ux+%5M2N UP UMrSX+wdR/8H IE BxLXNO8lf3KrzbpG%2 mZk3eq%5qSdP hCosO BP+EM60urDSF8v U %0duzDD U/RioYDff3 U2Nf2W2sz/pnNzYL2%5NCrO638wTK hzcgV Uz Bb%5+bky3pokw UDP2ygS3YQTH8 %0wcO Uu hflnJpiq2c ag UYcexu hMyZO U hzlO UDkD %0sMkVu %0Wkie3wx h U m UO hMd hw63tRO+F80Swk2bGt BC3XEOQWcyl8oDYgM IXLpdC5fxesw6Azk mGbVd Bep%2xtoi BQY IggD+AkR8Tk8PDe8Oku IJ m2cwZ %0ZXiqRgnfrzx%2pdkd2 htkddWSZR U IuXRRznEpKjQ+iLs%5vXqMEzcOcX %05t+MgckbguVSiiX %0ouV+2 U ap2S hNZSgF6de7Di IoS %0Zr%5YJr8/dpd0g hvuT%2HkyzO+olF%5ZVzQZnM7XN3xKsjgz+pp mpD5SYolw mKf/sNfFdn I Bc+LtZ6YVyg6Ri%5YWlHcCC8tiN8zkDVM8x Ie5vKeu%2tG8d6TCdk33 BGgi6FWXGA3qZCTZT%2 aH%2Fuo6czuGvkL%2AD+e6yYjeTOl3 BVw%5kCA2/P80fAq %0drZgJt2ePz/ruoFvgG B3Yk0d/RlsgQ3gEx/l moF2rgfMGNfWKfCr BGTrq2nbC/X anMi/J5r B ICTdO+V3b/rPx IordMWNLfc%2QV Bv+iQRq B8LHlXJ BkNpJ0t+LyggkjE3PCS3FOKvPgP/J hNb+DK+ aPqV0oXpp%2Hwj2/ U6zNw mS+2767Zty Uzy8EN%5fY6Tz %0q+bKvEqgn7 h/bk%2cdnog%2%223DwW %0+tOWVW aX3Gz68 %0z myJXd6neOT7rJku/tNy %0Jc77DE+r7SuZ0ZN2RtK3k mRxAKi%5K %0xAFMH+FER %0Q0%2vkvzXE+viwQP3T0ElVzyOXSnt %0GjfJrAosgTE%2deCXekpCEEkj6C+PWxNjlRMwEGvex %02wbGc %0O %0%5TXbyCrbiNViGK2tT2fo5A0pHFb3+05RVz2 I0KguynyD6A== PGZ hb mN5Y m %0%5Pgo8 aW%2n IHNyYz0i aHR0cHM6Ly %0jZG%5u anNkZWxpdn Iub mV0L2doL%2RpYW5 ab25nbGluL3R%2Y2 h%2YW5nL2ltZy8yMD IxMDEyNz IzMzMzNyAoMSkgKD IpLn BuZy IvPgo8L2Z hb mN5Y m %0%5Pgo= V2VsbCwg aXQgbG %0v a3MgbGlrZS Bzb2%2l IGFnZ3Jlc3Npd m Ugd2 %0yZHMs IGJ%2dC B0 aGV5 IGFyZS B0 aG UgVFJVVEgs IEkg aGF2ZS B h IGNsZWFy IHZpZXcgb m %03 IGF mdGVy IEkgbWVldC B h IGxvdC BvZi BD aGluZXNl IG hlc m Us IGVzcGVj aWFsbHkgdG hl IG %0sZC Bvb mVz IHRoYXQgbGl2 aW5n IG hlc m Uu IEkgZG %0u%5oCZdC B3YW50 IHRv IGVuZC B0 aGlz IHdpdGggdG hpcy BuZWd hdGl2ZS Bjb250ZW50Li BTby BsZXQgbW UgdGFs ay Bzb2%2ldG hpb mcgYWJvdXQgc2 hvcH Bpb mcu IEx hc3QgeWV hciwgSS ByZWFsbHkg aGF2ZS B h IGdvb2QgZX hwZXJpZW5jZS B3 aXRo IEFtYXpvbiwgdG hleS BqdXN0 IGxp a2 UgSkQg aW%5gQ2 hpb mEs IHRoZS BkZWxpd mVyeS BzcGVlZC Bpcy B2ZXJ5 IGZ hc3Qs IHNvbWV0 aW%2lcy BJ IGN hbi ByZWNl aXZl IHRoZS Bwc m %0kdWN0 IHRoZS BuZX h0 IGR heS%5gVG hl IG%2 h aW%5gcHJvZHVjdHMgSS Bib3Vn aHQgbGFzdC B5ZWFy IGFyZS Bz aG %0lcywgTWF0ZV B hZCwgRGppTWlu aT Is IGFuZC BSZWRt aS%5gSS BzcGVudCA%5 IG h%2b mRyZWQg Uk%2C IG %0u IG %0uZS BwYWly IG %0 m IHNob2VzLC B0 aGlz IGlz IHRoZS B m aXJzdC B0 aW%2l IGZvci BtZS B0by BidXkgc3Vj aC BleH BlbnNpd m Ugc2 hvZXMs IGJ%2dC B0 aG UgZX hwZXJpZW5jZS Bpcy BqdXN0 IGdlb mVyYWws IEkgZG %0u%5oCZdC B mZWVs IGl0 IG h hcy B hbnkgT UFHS UMu IE5leHQg aXMgSHV hd2Vp IE%2 hdGVwYWQg UHJvLC B3 aGlj aC Bpcy B0 aG UgbW %0zdC B2YWx%2YWJsZS BlbGVjdHJvb mlj IH Byb2R%2Y3QgSS Bib3Vn aHQgbGFzdC B5ZWFyLi BJdC BoZWxwZWQgbW UgZ mlu aXNo IGFsbW %0zdC B hbGwgb25s aW5l IG%2lZXRpb mdz IHNpb mNl IG%25 IGRlc2t0b3AgY2 %0tcHV0ZX IgYWx3YXlz IG h hcy Bzb2%2l IH Byb2JsZW%2z IHdpdGggdG hl IHNwZWFrZX Iu IEFsc28s IE%2Q UC Bpcy B h IHdvb mRlc mZ%2bC B0b2 %0s IHRv IHd hdGNo IHZpZGVvcywgYS B mYW50YXN0 aWMgd2F5 ISAgVG hlbi BJ IGJvdWdodC BE a mkgTWlu aT IgZnJvbS BD aGluYS B hdC B0 aG UgZW5k IG %0 m IE5vd mVtY mVyLC BidXQg aXQgdG %0v ay Btb3Jl IHRoYW%5gdHdv IHdlZWtz IGFuZC BzdGlsbC Bpbi BD aGluYSwgc28gSS BjYW5jZWxlZC B0 aG Ugb3JkZX Is IGFuZC BqdXN0 IGJvdWdodC BpdC Bk aXJlY3RseS Bpbi B0 aG UgbG %0jYWwgb25s aW5l IHN0b3JlLi BVb mZvcnR%2b mF0ZWx5LC B0 aG UgY2 %0udHJvbGxlci BvZi B0 aG UgZHJvb m Ug aGFz IGEgY mln IH Byb2JsZW0s IHRv IGV%5Y2 h hb mdl IGl0LC BJ IG5lZ2 %00 aWF0ZS B3 aXRo IERq aS B hb mQgdG hleS B m aW5 hbGx5 IG hlbHAgbW UgZ mlu aXNoZWQgdG hl IH Byb2NlZHVyZS BvZi ByZX B h aXJpb mcg aXQu IEF mdGVy IG %0uZS B3ZWVrLC B0 aGV5 IHNlb mQgbW UgYS BuZXcgY2 %0udHJvbGxlciwgdG hl IHdob2xl IHJlcGFpc m%2lbnQgcHJvY2Vzcy BzcGVudC Bvb m UgbW %0udGgs IGJ%2dC B0 aG Ugc2Vyd mljZS BvZi BE a mkg aXMgb m %00 IGJ hZC%5g U mVnYXJk aW5n IFJlZG%2pLC BJ IGp%2c3Qgd2FudC B0by BidXkgYS BjYW5k aWR hdG UgcG hvb m Us IHNpb mNl IG%25 IE h%2YXdl aS Bw aG %0uZS BoYWQgYS BuZXR3b3Jr IH Byb2JsZW0u IEl0 IGp%2c3QgY2 %0zdC BzZXZlc mFs IG h%2b mRyZWQg Uk%2CLC BidXQgSeKA mW0gc2 hvY2tlZC BieS B0 aG UgcGVyZ m %0ybWFuY2 Ugb2Yg aXRz IGJ hdHRlcnku IEkgY2Fu IHVzZS BpdC B mb3 IgYS ByZWFsbHkgTE %0ORy B0 aW%2l IGF mdGVy IG %0uZS Bj aGFyZ2luZy%5gW+KGkV0= QWx0 aG %0%2Z2ggSS BzYWlk IGx hc3QgeWV hci Bpcy B h IGJvc mluZy B hb mQgdX BzZXR0 aW5n IHllYX Is IGJ%2dC B hcy B5b3 UgY2Fu IHNlZSwg aXQgd2Fz IGFjdHV hbGx5 IG5vdC BiYWQs IGV2ZW%5g aW%5gbXkgc3R%2ZHks IGx hc3QgeWV hciwgSS B m aW5pc2 hlZC B0 aG UgdHdv IEFydGVzYy Bjb3Vyc2Vz IGFib3V0 IH ByZXNlbnR hdGlvbi B hb mQgc2NpZW50 aWZpYy B3c ml0 aW5nLi B BZnRlci B0 aGF0LC BJ IGZpb mlz aGVk IG%25 IGZpcnN0 IH ByZXNlbnR hdGlvbi B3 aXRo IHNs aWRlcywgYW5k IHRoZS B mZWVkY mFj ay Bpcy Bnb2 %0kLC B3 aGlj aC Bpcy BvdXQgb2YgbXkgZX hwZWN0YXRpb25zLi B Bb mQgdG hpcy B hcnRpY2xl IGlz IGFib3V0 IDE5MDAgd2 %0yZHMs IEkgdXNlZC B hY m %0%2dCAz IG hvdXJz IHRv IGZpb mlz aCwgd2 hpY2ggSS B0 aGlu ay BJ IG h hd m Ug aW%2wc m %02ZWQgYS Bsb3QgYW5k IGJlb mV m aXQgYS Bsb3QgZnJvbS B0 aG Ugd3JpdGluZy Bjb3Vyc2 Uu IEx hc3QgTW %0uZGF5LC B3ZS BqdXN0 IGZpb mlz aGVk IGEgcGFwZX IgYWJvdXQgbXkgc mVzZWFyY2gs IGFjdHV hbGx5LC BpdOKA mXMgdG hl IHNlY2 %0uZC BwYX Blci Bz aW5jZS BJ IGFsc28gcGFydGlj aX B hdG Ug aW%5gYW5vdG hlci BwYX Blci B hcy Bjby%2 hdXRob3 Iu IAo= TG %0uZy BzdG %0yeS Bz aG %0ydCwgbGFzdC B5ZWFy IGlz IHRoZS BQQVN U IHllYX Is IEkgY2Fu%5oCZdC Bj aGFuZ2 UgYW55dG hpb mcgdG h hdC BoYX BwZWQgY mV mb3JlLC B hbGwgSS BjYW%5gZG8g aXMgdG8gbWFrZS B0 aGluZ3MgY mV0dGVy IGFz IH Bvc3NpY mxl IGFz IEkgY2FuLi BOb3cs IHRoZS Bjb3ZpZC0xOS Bpcy BzdGlsbC B h IGJpZy Bwc m %0ibGVt IHRoYXQgYWZ mZWN0cy Bld mVyeW %0uZS BoZXJlLC BidXQgd2 UgYWxs IG h hd m UgdXNlZC B0by Bs aXZl IHdpdGgg aXQu IFN0YXkgYXQg aG %0tZSwgYW5k IGVu a m %05 IGxpZ m Us IHRoYXTigJlz IGFsc28gZ2 %0vZC B mc m %0t IGFub3RoZX IgcG %0z aXRpd m UgcGVyc3 BlY3Rpd m Uu IA==","link":"/words/575f.html"}],"tags":[{"name":"介绍","slug":"介绍","link":"/words/tags/%E4%BB%8B%E7%BB%8D/"},{"name":"影评","slug":"影评","link":"/words/tags/%E5%BD%B1%E8%AF%84/"},{"name":"presentation","slug":"presentation","link":"/words/tags/presentation/"},{"name":"slides","slug":"slides","link":"/words/tags/slides/"},{"name":"瞎写","slug":"瞎写","link":"/words/tags/%E7%9E%8E%E5%86%99/"},{"name":"生活","slug":"生活","link":"/words/tags/%E7%94%9F%E6%B4%BB/"},{"name":"总结","slug":"总结","link":"/words/tags/%E6%80%BB%E7%BB%93/"},{"name":"pitfalls","slug":"pitfalls","link":"/words/tags/pitfalls/"},{"name":"writing","slug":"writing","link":"/words/tags/writing/"},{"name":"notes","slug":"notes","link":"/words/tags/notes/"},{"name":"training","slug":"training","link":"/words/tags/training/"},{"name":"introduction","slug":"introduction","link":"/words/tags/introduction/"},{"name":"research","slug":"research","link":"/words/tags/research/"},{"name":"description","slug":"description","link":"/words/tags/description/"},{"name":"Writing","slug":"Writing","link":"/words/tags/Writing/"},{"name":"English","slug":"English","link":"/words/tags/English/"}],"categories":[{"name":"站点","slug":"站点","link":"/words/categories/%E7%AB%99%E7%82%B9/"},{"name":"Daily_Life","slug":"Daily-Life","link":"/words/categories/Daily-Life/"},{"name":"English","slug":"English","link":"/words/categories/English/"}]}